{
	"Accra":{
    "sprite": "accra",
		"x"    : 250,
		"y"    : 140,
		"govt" : "direc",
		"text": "The birthplace of the modern FTL drive, and as a result the capital of the Old Empire, a galaxy-spanning civilization that collapsed a generation ago. It was these shipyards that built the first wave of ships that crossed the sector, and is still a hub for ship construction. After the empire's collapse, most of the government fled, leaving the terrestrials in charge, many of them expert starship builders. They ultimately formed Accra Drive Systems, a successful manufacturer of modern starships, and an alliance of surrounding worlds called the Casamance Directorate.",
		"trade":{
			"alloy":"high",
			"grain":"high",
			"dut":"high",
			"uacbarrels":"high"
		}
	},
	
	"Alluvium Fleet Yards":{
		"sType":"aresShipyard",
		"x"    : -200,
		"y"    : -400,
		"govt" : "direc",
		"text": "Alluvium Fleet Yards is the flagship starship building site of Accra Stardrives. Every corridor you go down is bustling with activity - engineneers in animated discussion about robotic assembly, mechanics lugging exotic tools, and even sales people for Accra Drive Systems who, occasionally, realize that you're a starship captain and try to make a sale.",
		"tech":{
			"accra":3,
			"generic":3,
			"casa":3
		},
    "shipyard": true,
    "custom": true
},
	
	"Wajir":{
		"sType":"sgHighWinds",
    "sprite": "wajir",
		"x":0,
		"y":0,
		"text":"Accra orbits this gas giant."
	},
	
	"Dogover":{
		"sType":"gnPlanet12Marsh",
		"text" :"Although the Cartwright system has been populated for all of recorded history, it was not on this planet, since its harsh environment makes living difficult. Though there are signifigant metal deposits here, it is difficult to extract.",
		"x":100,
		"y":300,
		"govt":"direc",
		"trade":{
			"roto":"high",
			"dark":"high",
			"gas":"med",
      "metal":"med",
      "ore":"low"
		}
	},
	"Zachit":{
		"sType":"fourRingStation",
		"text":"Population center of the Cartwright system, the massive Zachit station is home to millions. Though it can generate its own power, it has long since replaced its agracultural segments with living space, favoring imports. As a result, traders favor the station as well.",
		"x":-100,
		"y":-348,
		"govt":"direc",
		"trade":{
			"water":"high",
			"grain":"high",
			"ethyl":"high"
		},
		"tech":{
			"generic":1,
			"accra":1,
			"direc":1
		}
	},
	"Miranu":{
		"sType":"onyxM4Earthlike",
		"govt":"direc",
		"text":"Orbiting opposite from Cartwright at Zachit's L3 Lagrangian Point, Miranu, a small world that is jealously guarded by the Zachit government as a premere vacation destination. Trips to it where largely kept secret from the public until 495 when the fact that the tiny planet that everyone could see was actually being landed on. It was the first step for the inhabitants of this system to the stars.",
		"x":200,
		"y":480
	},
	"Cook":{
		"sType": "onyxRedQ",
		"text" : "Cook's stark, reddish atmosphere is highly toxic due to its exotic composition of various heavy metals and deadly acids. However, beneth this harsh surface is a treasure trove of valuable minerals. Be sure to keep your shields up at all times, or the air will beign to corrode your hull.",
		"x": 75,
		"y": 150,
		"govt":"direc",
		"trade":{
			"dark":"low",
			"powerconv":"high"
		}
	},
	"Dafydd":{
		"sType": "aresSmallStation",
		"govt":"direc",
		"text" : "This station is jointly owned by member planets of the Directorate, and administered by its navy. It supports the various mining intrests on the inhospitable surface of Cook from orbit.",
		"trade":{
			"carbon":"high"
		},
		"tech":{
			"generic":1,
			"direc":1
		},
		"x": -150,
		"y": -75
	},
	"Encroachment Rein":{
		"sType": "anonplan",
		"text" : "Vast empty wasteland with a wispy xenon atmosphere and no apparent signs of inhabitence or reason to do so. There was once a colony here, but due to graft, mismanigment, and increasingly high costs, the colony was abandoned in disgust.",
		"x" :0,
		"y" :0
	},
	"Thrace":{
		"sType": "onyxRedU",
		"govt":"direc",
		"text": "A heavly populated (some would say overpopulated) world. Ostensably a major voting member of the directorate, with representatives converging yearly to decide matters of interplanetary importance. However, the planet is largely populated with the poor, as its climate is less than ideal.",
		"x" :24,
		"y" :-45,
		"tech":{
			"oe_wep":3,
			"fu":1,
			"generic":1,
			"direc":1,
			"kps":1
		},
		"trade":{
			"ethyl":"med",
			"alloy":"low",
			"grain":"high"
		}
	},
	"Argive":{
		"sType":"oneRingStation",
		"govt":"direc",
		"text":"Arguably the \"real\"; capital of Thrace, for this is where the wealthy of Thrace spend most of their time. It's been equipped with state of the art facilities and functions like a giant apartment building, or hotel. Many scandalous documentaries about wealth inequality have been recorded within its hallowed halls.",
		"x":10,
		"y":30
	},
	"Frontier Outpost IV":{
		"sType":"oeStation",
		"govt":"pen",
		"text":"This was once a border station, then later the jumping off point for the invasion of Itaska, and last home base of the 7th fleet. Now it's a border post facing the other way, and it's the main friendly contact point between the Itaskans and the rest of the galaxy. What little negotiation goes on tends to happen here.",
		"x":98,
		"y":15,
		"tech":{
			"oe_wep":3,
			"itaskan_wep":1
		}
	},
	"Sintashta":{
		"sType":"onyxDesertK",
		"text":"An inhospitable desert world with very little to recommend it.",
		"x":-40,
		"y":0
	},
	"DI - Lyrell":{
		"sType":"avJuno",
		"govt":"pen",
		"text" : "The last line of defense that the 7th fleet has, protecting Itaska. The guard here is largely cerimonial, as enemey ships have not been seen this deep into Itaskan terratory for hundreds of years. Still, it is a sign of reassurance to the Itaksans that the 7th fleet is there for them.",
		"x":139,
		"y":78,
		"tech":{
			"itaskan_wep":3,
			"itaskan_ship":2
		}
	},
	"Trowel":{
		"sType":"gnPlanet12Marsh",
		"text":"A beautiful terraforming success story, Trowel was abandoned in favor of more densely populated worlds around 450, and has since been sparsely populated, mostly by vacationing Itaskans.",
		"x":0,
		"y":0
	},
	"Kennerud":{
    "govt": "direc",
		"sType":"onyxEarthlikeB",
		"text":"A major industrial world, Kennerud has been slowly optomized over hundreds of years to turn out weapons and reactors, first for the empire, and now, as a member of the Directorate, for competing continent-spanning companies on the surface. The most powerful of all is KPS (Kennerud Power Systems) the universe's leading manufacturer of next-gen plasma weapons (according to KPS marketing.)",
		"tech":{
			"accra":1,
			"oe_wep":3,
			"generic":3,
			"kps":3,
			"direc":3,
			"oe_ship":3
		},
		"trade":{
			"grain":"med",
			"alloy":"high",
			"plas":"low",
			"roto":"med",
			"pure":"high",
			"powerconv":"med",
			"uacbarrels":"high"
		},
		"x":0,
		"y":0
	},
	"Diemos":{
		"sType":"Diemostype",
		"text":"It looks like somebody tried to turn this small moon into a colony ship, but judging by the state of the thing, they where unsuccessful in some way or other. You decide that it's probably best left alone, and return to your ship rather than proceeding down the unlit corridors that lead deeper into the battered moon.",
		"x":0,
		"y":0
	},
	"Phobos":{
		"sType":"Phobostype",
		"text":"It looks like there might have been a colony on the surface of this planet at some point, but not recently. Scans would indicate that several displacer-tech accidents happened here. Judging by the scarring on the walls, somebody with a rocket launcher shot the place up pretty well. You decide not to go any deeper, in case they're still around.",
		"trade":{
			"uacbarrels":"low"
		},
		"x":0,
		"y":0
	},
	"Harcourt":{
		"sType":"gnPlanet2Lunar",
		"text":"This lonely planet is deep inside the Reacher field, and rendered uninhabitable by somewhat frequent asteroid bombardment and radiation. Perhaps in a million years, when the force that formed the dust field is spent and every asteroid has had its turn making a crater on Harcourt, it will be ready for exploitation. But probably no sooner.",
		"x":0,
		"y":0
	},
	
	"XIC - Bluthgelt":{
		"sType":"avJabru",
		"govt":"xic",
		"text":"XIC makes a healthy profit from the asteroids in this system, due to its central location in the reacher field. Being that this station is only one jump away from civilization, XIC employees consider it a fairly easy posting, and generally hope to be sent here, versus other stations.",
		"tech":{
			"xic":1,
			"generic":2
		},
		"x":14,
		"y":-30
	},
	
	"Bjarne":{
		"sType":"onyxEarthlikeE",
    "sprite": "cloudy_blue",
		"govt":"direc",
		"text":"The surface of Bjarne is almost entirely covered with water, so most of its cities are mostly or entirely submerged, anchored to bedrock deep below the waves. Bjarne one of the most enterprise focused worlds in the Directorate. Its citizens have a reputation, perhaps deserved, of attention to technical detail.",
		"tech":{
			"khanda":2,
			"oe_wep":2,
			"oe_ship":1,
			"direc":1
		},
		"trade":{
			"water":"low",
			"alloy":"med",
			"roto":"low",
			"pure":"high",
      "scrod":"low",
			"powerconv":"high"
		},
		"x":0,
		"y":0
	},
	"Adriaan":{
		"sType":"onyxEarthlikeC",
		"govt":"direc",
		"text":"A pleasant, if slightly cold climate. The inhabitents of this planet formed a culture centered around various forms of committees, using them to decide everything from what types of goods to produce to who to send to represent them on Thrace.",
		"tech":{
			"generic":1,
			"khanda":1,
			"oe_wep":2,
			"oe_ship":1
		},
		"trade":{
			"water":"low",
			"alloy":"med",
			"ethyl":"high",
			"plas":"high"
		},
		"x":0,
		"y":0
	},
	"Kosach":{
    "sprite": "kosach",
		"govt":"drone",
		"text":"An industrialized world with a large population and matching production output. Factories run around the clock, building everything from starships to Rotovators.",
		"tech":{
			"generic":1
		},
		"trade":{
			"ethyl":"med",
			"plas":"low",
			"roto":"low"
		},
		"x":0,
		"y":0
	},
	"Kimathi":{
		"sType":"plutonic",
		"govt":"direc",
		"text":"This fridged ball of rock and ice was once a vital producer of starships and parts, but it has fallen on hard times and lacked the capital to re-tool its rusting factories. There's a grim determination among those who remain, though, all insisting that \"Kimathi will be good again, any time now\" but that remains to be seen.",
		"tech":{
			"oe_ship":3,
			"oe_wep":3,
			"generic":1
		},
		"trade":{
			"plas":"high",
			"water":"low",
			"dut":"med"
		},
		"x":0,
		"y":0
	},
	"Turkana":{
		"sType":"onyxEarthlikeD",
		"govt":"direc",
		"text":"In a remote corner of the Casamance Directorite floats Turkana, an agracultural paradise. Praised as one of the best terraformed worlds in Casamance space, it is covered in farms and dotted with agracultural plants. Many of the powerful famlies here can trace back to Emperial officers who chose this planet as a place of retirement.",
		"x":0,
		"y":0,
		"trade":{
			"agra":"high",
			"grain":"low",
			"roto":"high",
			"powerconv":"med"
		}
	},
	"Oromia":{
		"sType":"rwH01",
		"text":"The beautiful skies of Oromia are a result of the constant presence of silica particulates in the atmosphere, rendering it uninbahitable, because silica particulates are deadly.",
		"x":0,
		"y":0
	},
	"Meklin":{
		"sType":"gnPlanet1Lunar",
		"x":0,
		"y":0,
		"text":"Once the home of the epinomous Meklin Design Bearu, this barren rock was picked for its isolation. However, during the schism, the system became a battleground between the North and the League, so the planet was evacuated in 1100. The facilities remain, but anything of value has been removed or sabatoged to prevent capture. Most of the Meklin staff (and the title \"Meklin Design Bureau\") relocated to Tine the Peenemunde system, but some remained loyal to the north and joined them, forming the Kalush DB."
	},
	
	"Union 1":{
		"sType":"aresLargeStation",
		"govt":"hex",
		"x":45,
		"y":-30,
		"text":"Defending the League's northern border (and staking a permanent claim on Pyatigorsk), Union 1 is the first such station built, a symbol of cooperation between the member companies of the League.",
		"tech":{
			"lg_ship":3,
			"khanda":1,
			"melkin":3
		}
	},
	"Kalush":{
		"sType":"gnPlanet5Red",
		"govt":"drone",
		"tech":{
			"generic":3
			},
		"x":0,
		"y":0,
		"text":"This remote, volcanic wasteland is where some of the greatest minds of the northern empire strive to design next-generation weapons and starships. The sheer amount of antimatter here means that it is often incorrectly regarded as the \"most likley planet in tne empire to explode\"."
	},
	"Frontier Outpost V":{
		"sType":"oeStation",
		"govt":"fifth",
		"text":"The nearest Fifth Fleet outpost to other civilizations, this old frontier outpost now guards against incursions from inner worlds, marking the border to what the Fifth Fleet would describe as the \"last remnants of the empire\".",
		"tech":{
			"oe_wep":3,
			"V":3
		},
		"x":0,
		"y":0
	},
	"Ubuntu":{
		"sType":"rwA01",
		"x":100,
		"y":123,
		"govt":"direc",
		"text":"Despite its appearance, Ubuntu is actually a very habitable planet once you get used to the environment. It specializes in manufacturing computer components, and providing support. Because faster than light radio is impossible, support generally consists of flying an engieneer out to the installation site.",
		"trade":{
			"compu":"low",
			"pure":"high",
			"powerconv":"med"
		}
	},
	"Mint":{
		"sType":"gnPlanet10Green",
		"x":30,
		"y":-25,
		"text":"It is theorized that Mint spun off of Ubuntu some time in the unfathomable past."
	},
	"Tyne":{
		"sType":"rwH00",
		"x":0,
		"y":0,
		"govt":"hex",
		"text":"The current home of the Meklin Design Bureau, Tyne is a major hub of equipment production for the League generally, and Meklin specifically. The Bureau is especially known for its large starships, the Oxana and Vera.",
		"tech":{
			"melkin":3,
			"lg_ship":3,
			"generic":3,
			"accra":1
		},
		"trade":{
			"alloy":"high",
			"dark":"high",
			"xerum":"high",
			"gas":"high",
			"ezo":"high",
			"plas":"high"
		}
	},
	"Vatsa":{
		"sType":"rwG00",
		"govt":"direc",
		"x":0,
		"y":0,
		"tech":{
			"oe_wep":3,
			"oe_ship":2,
			"generic":1,
			"wlkn":2
		},
		"text":"Vatsa's production capacity has always been stimied by mismanagement, and as a result abandoned OE factories rust in toxic fields, but enough still run for a steady starship buisness."
	},
	"Kopachy":{
		"sType":"onyxM1Lunar",
		"x":0,
		"y":0,
		"text":"Kopatchy was a moderately populous world before the empire burned off its atmosphere in 934 in the last, desperate years of its conflict with the peninsula. Since then the spoiled has stood as a memorial to the conflict which many Itaskans consider un-finished."
	},
	"DVI - Strelok":{
		"sType":"avGaruda",
		"x":75,
		"y":-143,
		"tech":{
			"itaskan_wep":2
		},
		"text":"One of a few on the Empire/Itaska border, this station is part of the Itaskan territory claimed by the Northern Empire, so it suffers from the most violent incursions. Those stationed here are battle-hardened veterans, ready to leap into starships at a moment's notice."
	},
	"Sinaqara":{
		"sType":"onyxDesertJ",
		"x":0,
		"y":0,
		"tech":{
			"generic":3,
			"wlkn":3
		},
		"trade":{
			"water":"high",
			"grain":"high",
			"pure":"high",
			"dark":"high",
			"xerum":"high"
		},
		"text":"An anchient homeworld, its distance from centers of conflict, Sinaqara was one of the safest planets for most of its history. However, recent Itaskan raids have given it a bad reputation."
	},
	"Kuzma":{
		"sType":"onyxDesertP",
		"scape":"img/AVDezign/Igalilik.jpg",
		"x":0,
		"y":0,
		"govt":"pen",
		"tech":{
			"generic":3
		},
		"text":"One of the warmest planets on the Itaskan peninsula, the inhabitants enjoy warm winters and hotter summers."
	},
	"Cobb":{
		"sType":"gnPlanet11Maroon",
		"scape":"img/AVDezign/Faivarongo.jpg",
		"x":0,
		"y":0,
		"govt":"pen",
		"text":"A lonely outpost on the NE border, Cobb has many old bases but most navy activity takes place in orbit on the DIII. It is mostly a warehouse."
	},
	
	"DIII - Loneozner":{
		"sType":"avWusquus",
		"x":30,
		"y":100,
		"govt":"pen",
		"text":"As far as NE border posts go, this one is quiet. The Imperials do not regularly skirmish in this system, and it is widely considered a backwater. Flotilla III, the flotilla based here, constantly emphasizes the feeling of dread that they experience, not knowing when the next attack will be.",
		"tech":{
			"generic":2,
			"itaskan_wep":2,
			"itaskan_ship":1
		}
	},
	"Mariposa":{
		"sType":"onyxM5Earthlike",
		"scape":"img/AVDezign/Aegir.jpg",
		"govt":"pen",
		"x":295,
		"y":-125,
		"text":"The population center of the Albacore system. Mariposa's small size (and large oceans) lead to its population density quickly overwhelming its resources early in its history, and lead to much movement off-world. In the years since, it has been a priority of the planet's government to repair the damage done to its environment before the invention of fusion power.",
		"tech":{
			"generic":2,
			"itaskan_wep":2,
			"itaskan_ship":1
		},
		"trade":{
			"water":"low",
			"grain":"high",
			"pure":"med",
			"ethyl":"med"
		}
	},
	"Merced":{
		"sType":"onyxM8Red",
		"x":184,
		"y":203,
		"text":"This unremarkable moon has only one feature of interplanetary intrest-it is one of the few known sources of 'Xerum', also known as red mercury",
		"trade":{
			"xerum":"low"
		}
	},
	"Tuolumne":{
    "sprite": "tolumne",
		"x":-225,
		"y":-318,
		"text":"Forsaken Desert"
	},
	"Yosemite":{
		"sType":"sgDrye",
		"x":0,
		"y":0,
		"text":"Gas giant that almost made Albacore a double star system."
	},
	"Pajitnov":{
		"sType":"onyxEarthlikeG",
		"scape":"img/AVDezign/Fujin.jpg",
		"govt":"pen",
		"x":0,
		"y":0,
		"text":"Pajitnov is as aristocratic as you can really get in the peninsula, with high-tech and administrative activity during the day and lavish parties at stunning techno-villas at night. It helps that its nights last 36 hours."
	},
	"Tamt":{
		"sType":"gnPlanet13Purple",
		"scape":"img/AVDezign/Sogblen.jpg",
		"govt":"pen",
		"x":0,
		"y":0,
		"text":"The tech center of the Peninsula, this is the home of the Seventh Fleet Skunk Works. Far from the border, this highly classified planet is dotted with exotic labrotories where the laws of physics are treated more as guidlines.",
		"tech":{
			"generic":3,
			"itaskan_wep":3,
			"itaskan_ship":3
		}
	},
	"MCB-1":{
		"sType":"avWusquus",
		"govt":"pen",
		"x":-100,
		"y":-35,
		"text":"MCB-1 is an isolated station used to test new weapons and technology that are too dangerous to use planetside."
	},
	"Angeles":{
		"sType":"onyxLunarV",
		"scape":"img/AVDezign/Camulos.jpg",
		"govt":"pen",
		"x":0,
		"y":0,
		"text":"With no biosphere, Angeles was an ideal testbed for airtight colony technology. It was a smashing success and its population now numbers in the tens of billions. Some of the best-smelling recycled air in the galaxy can be found in the tunnels and domes here, but most goods need to be brought from off-world.",
		"trade":{
			"water":"high",
			"grain":"high",
			"pure":"low",
			"ethyl":"high",
			"compu":"med",
			"uacbarrels":"med"
		},
		"tech":{
			"generic":2,
			"itaskan_wep":3
		}
	},
	"Izumrudnoye":{
    "sprite": "izumrudnoye",
		"scape":"img/AVDezign/Ekchuah.jpg",
		"govt":"pen",
		"x":-10,
		"y":20,
		"text":"The methane atmosphere makes the planet unattractive except for mining operations.",
		"trade":{
			"alloy":"low",
			"pure":"med",
			"gas":"low",
			"plas":"med"
		}
	},
	"Aralsk":{
		"sType":"gnPlanet6Rock",
		"scape":"img/AVDezign/Balder.jpg",
		"govt":"pen",
		"x":-50,
		"y":-300,
		"text":"Aralsk was dealt a crippling environmental blow at some point in its history, and is now mostly occupied by scientists who study the dried out oceans and giant tectonic fissueres, hoping to discover what dread fate befell the planet, if other similarly sized worlds are at risk, and how it could be averted."
	},
	"Itaskana":{
		"sType":"gnPlanet11Maroon",
		"scape":"img/AVDezign/Yamaduti.jpg",
		"govt":"pen",
		"x":0,
		"y":0,
		"text":"The center of Itaskan civilization, Itaskana is the namesake of the 'peninsula' of isolated stars that the Itaskans call home. Schoolchildren are shuttled here to see the famous parlament chambers the great treaties creating Itaska's government where signed, and the labs shield technology that enabled it matured. Sadly it is one of the few worlds in the peninsula so environmentally ruined that it is considered a lost cause, a victim of centuries of rapid technological progress and unchecked plasma experiments."
	},
	"Gillespie":{
		"sType":"onyxM7Desert",
		"scape":"img/AVDezign/YumCimil.jpg",
		"govt":"pen",
		"x":-38,
		"y":49,
		"text":"Populated since at least 200, Gillespie was a very attractive target for off-world colonization, so the lanscape is a patchwork of different visions of extraplanetary utopia. It has been called the 'mother of itaskan spaceflight' since if it wasn't so close to Itaskana, they might have never had a reason to develop starship technology. Though it's speculated that people arrived on every planet by spaceflight in the first place.",
    "trade": {
      "food": "high",
      "kombucha": "high"
    }
	},
	"Buttonwood":{
		"sType":"rwI01",
		"scape":"img/AVDezign/Zipakna.jpg",
		"govt":"pen",
		"x":300,
		"y":-30,
		"text":"Over the last five hundred years, inhabitants have been moving from Itaskana to Buttonwood, due to radiation in Itaskana's seriously ionized atmosphere. It was home to the \"Buttonwood Accords\" where bans on environmentally destructive practices where put into effect throughout Itaskan space, settling what is called the \"last generational fued\" in the 330s.",
		"trade":{
			"compu":"high",
			"water":"high",
			"grain":"high",
			"alloy":"high",
			"pure":"high"
		}
	},
	"Chukchi":{
		"sType":"sgSmall",
		"scape":"img/AVDezign/Tin.jpg",
		"govt":"pen",
		"x":0,
		"y":0,
		"text":"Gas giants aren't usually habitable, but Chukchi is the exception. The 'pseudomoons' in orbit are held against friction by the planet's magnetic field, protected from erosion by Scrith and Darksteel deposits."
	},
	"Sinchenko":{
		"sType":"rwP01",
		"scape":"img/AVDezign/Usas.jpg",
		"govt":"pen",
		"x":300,
		"y":450,
		"text":"A middling planet in most respects, Sinchenko is the cultural heart of the peninsula, hosting epic concerts that draw crowds of millions on a regular basis.",
		"trade":{
			"ethyl":"high",
			"spice":"high",
			"uacbarrels":"med"
		}
	},
	"Coldwater":{
		"sType":"onyxIceN",
		"govt":"direc",
		"x":0,
		"y":0,
		"trade":{
			"water":"low",
			"grain":"med",
			"alloy":"med"
		},
		"text":"On the tense border between the Casamance Directorate and the Eastern League, coldwater's chilly landscape is listed as the most likley planet to be invaded in Casamance space. It's rumored that there are large fortresses cut into the glaciers, but the navy is quiet on the subject."
	},
  "Baikonur":{
    "govt": "drone",
    "x": 0,
    "y": 0,
    "trade":{
      "ethyl": "high",
      "water": "low",
      "grain": "high"
    },
    "text": "Settled, if the histories are to be believed, by spacefarers from Itaskana, Baikonur was once the heart of a spacefaring civlization of its own, before it became the final conquest of the empire, and now cherished posession of the Northern Empire. Perhaps as a last act of defiance, shipyards here producing old Baikonur craft still operate, and are well regarded civilian vessels."
  },
  "Nightside": {
    "govt": "orasos",
    "x": 0,
    "y": 0,
    "trade": {
      "ethyl": "high",
      "grain": "high",
      "gas": "high"
    },
    "text": "As with any tidally locked world, Nightside rotates very slowly in relation to its parent star-in this case less than once per million years. This means that only one side of the planet has a tolerable climate-leading to its name. Far from civilization and deep in a pirate infested nebula, Nightside is a hub of illegal activity. You can get anything here for the right price, but nobody can pay as much as the Caudron family, so they're in charge."
  },
  "Horizon": {
    "govt": "drone",
    "x": 0,
    "y": 0,
    "text": "Horizon is tidally locked such that a \"day\" lasts about a hundred years, most of which is in punishing cold and darnkess or unbearable heat and light. This has pushed the civilization here to adopt a nomadic lifestyle, building elaborite (and enormous) land vehicles which can relocate as the terminator moves across the surface."
  },
  "Broken Hill": {
    "text": "A warm, dry, dusty planet where you wouldn't expect too much wildlife. However, it's teeming with some of the deadliest creatures in the galaxy. An evolutionary arms race has lead to the development of increasingly deadly venoms and antivenims, toxins and antidotes. It is advised that you take care while traveling here."
  },
  "Wieliczka": {
    "text": "Though the surface of Wieliczka is arid, its appearance is deceptive-its oceans are all under ground. Though not especially dense, and permiable enough for the roots of mighty trees to reach down into the brine, the surface is enough to shield the cities of Wieliczka from the harsh glare of its parent star, Rainsford."
  },
  "Krysto": {
    "text": "The low gravity of this remote, small planet is the ideal condition for propulsion research (and, incidentally, long jump.) The world is more agglomeration of comets than terrestrial planet, though bitter winds powered by tidal forces from its dim star have long since erased evidence of the anchinent impacts. Extensive ice tunnels and secret bases are supposedly just below the rough, spiky surface."
  },
  "Bukov":{
    "govt": "drone",
    "x": 25,
    "y": 38,
    "text": "Bukov's spaceport is in the center of a blast-swept plane of green trinitite glass, surrounded by thick walls of nanocrete, and staffed by pitiless marines. This security is needed, of course, because the rest of the planet, including all of its major cities, is used as a prison by the empire. It was discovered at some point that in some cases, such as radical Bikonour partisans (many of whom already lived on Bukov, it should be noted) it would be cheaper to cordon off an entire world than to build additional prison stations."
  },
  "Kejetia": {
    "govt": "direc",
    "x": 0,
    "y": 0,
    "text": "If there's a bright center to the casamance directorate, this is the point that it's furthest from. Pirate raids are a regular sight in the skies over Kejetia. Attempts to contact additional civilizations or find fertile planets beyond this point have proved fruitless."
  },
  "Kufuor": {
    "govt": "direc",
    "x": 0,
    "y": 0,
    "text": "Just far enough from Akosombo Nebula to avoid the worst effects, Kufuor is still a relatively harsh environment. It has earned its reputation as a waystation for ill fated expolorers-no direct jump path has been discovered into the nebula from here. It is also a waystation for Casamance Navy ships hunting outlawed pirates into the frontier."
  },
  "Broken Arrow": {
    "govt": "direc",
    "x": 0,
    "y": 0,
    "text": "Broken Arrow has a warm, dry climate, perfect for many types of hardy megafauna which they heard as livestock here. Giant mechanical suits are employed by the farmers to drive the enormous beasts around (and avoid being trampled under foot.)",
    "trade": {
      "alloy": "med",
      "pure": "high",
      "scrod": "high",
      "food": "low"
    }
  },
  "Frontier Outpost III": {
    "govt": "direc",
    "x": 0,
    "y": 0,
    "text": "This station marks not only the furthest \"southern\" extent of the old empire, but also the furthest habitation in this galactic direction. It was empty then, and it's empty now. No human-occipied homeworlds have been found beyond it, and Broken Arrow was the only successful settlement in the region. The only people who go beyond are those who have nowhere else to go, desperate pirates, killers and outlaws."
  },
  "Veracruz": {
    "x": 0,
    "y": 0,
    "govt": "hex",
    "text": "An anchient and expertly terraformed homeworld, Veracruz is best known as the seat of power of the Sinod of the Six - a popular but young regional faith that believes that the six hyperlanes that converge on the Kuluene system are a sign that the Great Being is going to be reincatnated somewhere on Veracruz-though as yet, no candidate messiah has passed the rigorous testing process. The Sinod is, interestingly enough, a full member of the League.",
    "trade": {
      "scriptures": "low",
      "food": "high",
      "medicine": "med"
    }
  },
  "Quicksilver": {
    "x": 0,
    "y": 0,
    "govt": "drone",
    "sprite": "quicksilver",
    "text": "Quicksilver is named for its brilliant mercury oceans. The winds and tides keep the surface fresh enough that it is never fully oxidized, even though its atmosphere and landmasses have a considerable amount of iron oxide. Metals are the name of the game here. It's not as if people would choose to live here for any other reason, though you must admit that the view of the glassy silver ocean is stunning.",
    "trade": {
      "pure": "low"
    }
  },
  "Franconia": {
    "x": 0,
    "y": 0,
    "govt": "drone",
    "sprite": "blue_atmo",
    "text": "Franconia's methane rich atmosphere makes it smell a bit off, but an excellent place to grow all manner of microbes. Fermented beverages are all the rage here, and you can find dozens of small vendors of beer, mead, and something called \"Komubcha\"",
    "trade": {
      "food": "low",
      "kombucha": "low",
      "pure": "high"
    }
  },
  "Vasconcells": {
    "x": 15,
    "y": -15,
    "govt": "direc",
    "text": "A newly settled world, most people on Vasconcells (or at least their parents) where born on Sinquara. The Vasconcells Concern, a company which has bought up most of the liveable surface, is offering relocation vouchers for residents to come mine valuable ore here.",
    "trade": {
      "ore": "low",
      "food": "high"
    }
  },
  "Arruda": {
    "x": -15,
    "y": 15,
    "govt": "direc",
    "text": "The directorate maintains a small presence here, but with plenty of other places to put its growing population, Arruda has remained, thus far, unappealing."
  }
}
