{
	"Accra":{
    "sprite": "accra",
		"x"    : 250,
		"y"    : 140,
		"govt" : "free",
		"text": "The birthplace of the modern FTL drive, and as a result the capital of the Old Empire, a galaxy-spanning civilization that collapsed a generation ago. It was these shipyards that built the first wave of ships that crossed the sector, and is still a hub for ship construction. After the empire's collapse, the spacefarer upper-class was driven out, forming the Loyal Suns to the north and leaving the terrestrials in charge. The inhabitants of Accra They ultimately formed Accra Stardrives, a shipbuilder that focuses on large vessels and an alliance of surrounding worlds called the Casamance Freehold.",
		"trade":{
			"alloy":"high",
			"grain":"high",
			"dut":"high",
			"uacbarrels":"high"
		}
	},
	"Alluvium Fleet Yards":{
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
		"x"    : -200,
		"y"    : -400,
		"govt" : "free",
		"text": "Alluvium Fleet Yards is the flagship starship building site of Accra Stardrives. Every corridor you go down is bustling with activity - engineers in animated discussion about robotic assembly, mechanics lugging exotic tools, and even sales people who, occasionally, realize that you're a starship captain and try to make a sale.",
		"tech":{
			"accra":4,
			"generic":3,
			"free":4,
      "league_civ": 2
		},
    "shipyard": true,
    "custom": true
  },
	"Wajir":{
		"sType":"sgHighWinds",
    "sprite": "wajir",
		"text":"Accra orbits this gas giant."
	},
	"Carnarc":{
		"sprite":"carnarc",
		"text" :"Although the Inverness system has been populated for all of recorded history, it was not on this planet, since its environment keeps all but the hardiest of settlers at bay. Though there are significant metal deposits here, it is deep in the crust so only the best veins are mined. So-called 'wildcat' prospectors can be found deep in the interiors of the tectonic cratons looking for the next big score. More often than not, they come up empty handed.",
		"x":100,
		"y":300,
		"govt":"free",
		"trade":{
			"roto":"high",
			"dark":"high",
			"gas":"med",
      "metal":"med",
      "ore":"low"
		}
	},
	"Skye Orbital":{
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
		"text":"Population center of the Inverness system, the massive Skye orbital station is home to millions. Though it can generate its own power and once had its own food supply, it has long since replaced its agriculture segments with living space, favoring imports. As it happens, vat grown yeast slurry isn't a popular dish after the first few decades. As a result, merchants from across the Freehold make this their port of call.",
		"x":-100,
		"y":-348,
		"govt":"free",
		"trade":{
			"water":"high",
			"grain":"high",
			"ethyl":"high"
		},
		"tech":{
			"generic":1,
			"accra":1,
			"free":1
		},
    "shipyard": true,
    "customize": true
	},
	"Inshes":{
		"sType":"onyxM4Earthlike",
		"govt":"free",
		"text":"Orbiting opposite from Carnarc's L3 Lagrangian Point, Inshes, a small world is jealously guarded by the Carnarc government as a premier vacation destination. Trips to it where largely kept secret from the public until 495 when the fact that the tiny dot visible in the sky was actually being landed on. It was the first step for the inhabitants of this system to the stars.",
		"x":200,
		"y":480
	},
	"Lanner":{
		"sType": "onyxRedQ",
		"text" : "Lanner's stark, reddish atmosphere is highly toxic due to its exotic composition of various heavy metals and deadly acids. However, beneath this harsh surface is a treasure trove of valuable minerals. Be sure to keep your shields up at all times, or the air will begin to corrode your hull.",
		"x": 75,
		"y": 150,
		"govt":"free",
		"trade":{
			"dark":"low",
			"powerconv":"high"
		}
	},
	"Lanner Orbital":{
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
		"govt":"free",
		"text" : "This station is jointly owned by the Freehold worlds, and administered by its navy. It supports the various mining interests on the inhospitable surface of Lanner from orbit. Vac-suit miners tend to be tough and solitary people, and this station has developed an equally tough reputation.",
		"trade":{
			"carbon":"high"
		},
		"x": -150,
		"y": -75,
		"tech":{
			"generic":1,
			"accra":1,
			"free": 2,
      "league_civ": 1
		},
    "shipyard": true
	},
	"Encroachment Rein":{
		"sType": "anonplan",
		"text" : "Vast empty wasteland with a wispy xenon atmosphere and no apparent signs of inhabitance or reason to do so. There was once a colony here, but due to graft, mismanagement, and increasingly high costs, it was abandoned in disgust."
	},
	"Thrace":{
		"sType": "onyxRedU",
		"govt":"free",
		"text": "A densely populated world. Ostensibly a major voting member of the Freehold (proportional representation and all), with representatives converging yearly to decide matters of interplanetary importance. However, the planet's wealth is not proportional to its population, as its climate and pollution levels is less than ideal, so most of its ruling class live off-world and only maintain addresses here for legal reasons.",
		"x" :24,
		"y" :-45,
		"tech":{
			"oe":3,
			"generic":1,
			"free":2,
      "league_civ": 2
		},
    "upgrades": true,
		"trade":{
			"ethyl":"med",
			"alloy":"low",
			"grain":"high"
		}
	},
	"Argive":{
    "sprite": "civ_station",
		"govt":"free",
		"text":"Arguably the \"real\"; capital of Thrace, for this is where the wealthy of Thrace spend most of their time. It's been equipped with state of the art facilities and functions like a giant apartment building, or hotel. Many scandalous documentaries about wealth inequality have been recorded within these hallowed halls.",
		"x":10,
		"y":30
	},
	"Frontier Outpost IV":{
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
		"govt":"itaska",
		"text":"This was once a border station, then later the jumping off point for the invasion of Itaska, the final home base of the 7th fleet. Now it's a border post facing the other way, and it's the main friendly contact point between the Itaskans and the rest of the galaxy.",
		"x":98,
		"y":15,
		"tech":{
			"oe":3,
      "itaska": 1
		},
    "shipyard": true,
    "upgrades": true
	},
	"Sintashta":{
		"sType":"onyxDesertK",
		"text":"An inhospitable desert world with very little to recommend it. It is rumored that if you take your helmet off it smells faintly of roses, however you'd need to put it back on pretty quickly.",
		"x":-40,
		"y":0
	},
	"DI - Lyrell":{
		"sType":"avJuno",
		"govt":"itaska",
		"text" : "The 7th fleet's last line of defense. The guard here is largely ceremonial, generally to be found in stylish dress uniforms, as enemy ships have not been seen this deep into Itaskan territory for hundreds of years. Still, it is a sign of reassurance to the Itaksans that the 7th fleet is there for them.",
		"x":139,
		"y":78,
		"tech":{
      "itaska": 3,
      "generic": 3
		},
    "shipyard": true,
    "customize": true
	},
	"Trowel":{
		"sType":"gnPlanet12Marsh",
		"text":"A terraforming success story, Trowel was abandoned in favor of more densely populated worlds around 450, and has since been sparsely populated, mostly by tourists. Handcrafted waterfalls and pristine minerally-altered waters as far as the eye can see."
	},
	"Kennerud":{
    "govt": "free",
		"sType":"onyxEarthlikeB",
		"text":"A major industrial hub, Kennerud has been slowly optimized over hundreds of years to turn out weapons and reactors, first for the Empire, and now, as a member of the Freehold, for competing continent-spanning companies on the surface. The most powerful of all is KPS (Kennerud Power Systems) chief supplier of both legacy and next-gen plasma cannons.",
		"tech":{
			"accra":1,
			"oe_wep":3,
			"generic":3,
			"kps":3,
			"free":3,
			"oe_ship":3
		},
		"trade":{
			"grain":"med",
			"alloy":"high",
			"plas":"low",
			"roto":"med",
			"pure":"high",
			"powerconv":"med",
			"uacbarrels":"high"
		}
	},
	"Deimos":{
		"sType":"Diemostype",
		"text":"It looks like somebody tried to turn this small moon into a colony ship, but judging by the state of the thing, they where unsuccessful in some way or other. You decide that it's probably best left alone, and return to your ship rather than proceeding down the unlit corridors that lead deeper into the battered moon."
	},
	"Phobos":{
		"sType":"Phobostype",
		"text":"It looks like there might have been a colony on the surface of this planet at some point, but not recently. Scans would indicate that several entangled-matter accidents happened here. Additionally, judging by the scarring on the walls, somebody with a rocket launcher shot the place up pretty good. You decide not to go any deeper, in case they're still around.",
		"trade":{
			"uacbarrels":"low"
		}
	},
	"Harcourt":{
		"sType":"gnPlanet2Lunar",
		"text":"This lonely planet is deep inside the Reacher field, and rendered uninhabitable by alarmingly regular asteroid bombardment and nebular radiation. Perhaps in a million years, when the force that formed the dust field is spent and every asteroid has had its turn making a crater, it will be ready for exploitation. But no sooner."
	},
	
	"XIC - Bluthgelt":{
		"sType":"avJabru",
		"govt":"xic",
		"text":"XIC makes a healthy profit from the asteroids in this system, due to its central location in the Reacher field. Being that this station is only one jump away from civilization, XIC employees consider it a fairly easy posting, and generally hope to be sent here, versus other stations.",
		"tech":{
			"xic":3,
			"generic":2
		},
		"x":14,
		"y":-30,
    "shipyard": true,
    "upgrades": true
	},
	
	"Bjarne":{
		"sType":"onyxEarthlikeE",
    "sprite": "cloudy_blue",
		"govt":"free",
		"text":"The surface of Bjarne is almost entirely covered with water, so most of its cities are mostly or entirely submerged, anchored to bedrock deep below the waves. Bjarne one of the most enterprise focused worlds in the Directorate. Its citizens have a reputation, perhaps deserved, of attention to technical detail. This reputation perhaps stems from dealing with the unrelenting sea for generations-many planets have unbreathable atmospheres, but the oceans of Bjarne will eat away at your fittings, rust away anything you throw at them, and somehow your best laid plans will leak.",
		"tech":{
      "league_civ": 2,
      "oe": 2,
			"free":1
		},
    "shipyard": true,
    "upgrades": true,
		"trade":{
			"water":"low",
			"alloy":"med",
			"roto":"low",
			"pure":"high",
      "scrod":"low",
			"powerconv":"high"
		}
	},
	"Adriaan":{
		"sType":"onyxEarthlikeC",
		"govt":"free",
		"text":"A pleasant, if slightly cold climate. The inhabitants of this planet formed a culture centered around various forms of committees, using them to decide everything from what types of goods to produce to who to send to represent them on Thrace.",
		"tech":{
			"generic":1,
      "league_civ": 2,
			"oe_wep":2,
			"oe_ship":1
		},
    "upgrades": true,
    
		"trade":{
			"water":"low",
			"alloy":"med",
			"ethyl":"high",
			"plas":"high"
		}
	},
	"Kosach":{
    "sprite": "kosach",
		"govt":"loyal",
		"text":"An industrialized world with a large population and matching production output. Factories run around the clock, building everything from starships to Rotovators. They're so productive here that the Loyal Suns even let them keep a portion of the profits, which is a source of great pride.",
		"tech":{
			"generic":2,
      "loyal": 2,
      "oe": 1
		},
    "shipyard": true,
    "upgrades": true,
		"trade":{
			"ethyl":"med",
			"plas":"low",
			"roto":"low"
		}
	},
	"Kimathi":{
		"sType":"plutonic",
		"govt":"free",
		"text":"This frigid ball of rock and ice was once a vital producer of starships and parts, but it has fallen on hard times and lacked the capital to re-tool its rusting factories. There's a grim determination among those who remain, though, all insisting that \"Kimathi will be good again, any time now\" but that remains to be seen.",
		"tech":{
      "oe": 3,
			"generic":2
		},
    "shipyard": true,
		"trade":{
			"plas":"high",
			"water":"low",
			"dut":"med"
		}
	},
	"Turkana":{
		"sType":"onyxEarthlikeD",
		"govt":"free",
		"text":"In a remote corner of the Casamance Freehold floats Turkana, an agricultural paradise. Praised as one of the best terraformed worlds in Casamance space, it is covered in farms and dotted with mills. Many of the powerful families here can trace back to imperial officers who chose this planet as a place of retirement.",
		"x":0,
		"y":0,
		"trade":{
			"agra":"high",
			"grain":"low",
			"roto":"high",
			"powerconv":"med"
		}
	},
	"Oromia":{
		"sType":"rwH01",
		"text":"The beautiful skies of Oromia are a result of the constant presence of silica particulates in the atmosphere, rendering it uninhabitable, because silica particulates are quite deadly."
	},
	"Meklin":{
		"sType":"gnPlanet1Lunar",
		"text":"Once the home of the eponymous Meklin Design Bureau, this barren rock was picked for its isolation and lack of real estate value. However, during the schism, the system became a battleground between the Loyalists and the League, so the planet was evacuated in 1100. The facilities remain, but anything of value has been removed or sabotaged to prevent capture. Most of the Meklin staff (and the title \"Meklin Design Bureau\") relocated to Tine the Peenemunde system, but some defected to the Loyalists, forming the Kalush DB."
	},
	
	"Union 1":{
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
		"govt":"league",
		"x":45,
		"y":-30,
		"text":"Defending the League's northern border (and staking a permanent claim on Pyatigorsk), Union 1 is the first such station built, a symbol of cooperation between the subsidiary companies of the League. Its early construction, however, means it's amenities are a bit spartan compared to the more decadent stations of recent construction.",
		"tech":{
      "league": 2,
      "league_civ": 3,
      "generic": 1
		},
    "shipyard": true,
    "upgrades": true
	},
	"Kalush":{
		"sType":"gnPlanet5Red",
		"govt":"loyal",
		"tech":{
			"generic":3,
      "ls": 3
		},
    "shipyard": true,
    "upgrades": true,
		"text":"This remote, volcanic wasteland is where some of the greatest minds of the Loyal Suns strive to design ever deadlier weapons and starships. The sheer amount of antimatter here means that it is often incorrectly regarded as the \"most likely planet in the Loyal Suns to explode\". In fact, many other planets are much more likely to explode, but that's entirely due to risk incurred by their rebellious nature."
	},
	"Frontier Outpost V":{
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
		"govt":"loyal",
		"text":"An old outpost on the edge of Loyal Suns territory, it is nonetheless a critical jumping-off point for raids on the Lothian, Peenemunde, and Ingolsdat systems, so it's been kept very much up to date.",
		"tech":{
      "oe": 1,
      "generic": 1,
      "loyal": 1
		},
    "upgrades": true
	},
	"Ubuntu":{
		"sType":"rwA01",
		"x":100,
		"y":123,
		"govt":"free",
		"text":"Despite its appearance, Ubuntu is actually a very habitable planet once you get used to the environment. It specializes in computer software and providing support. Because faster than light communication is impossible except by delivery (which residents deride as 'sneakernet'), support generally consists of flying an engineer out to the installation site.",
		"trade":{
			"compu":"low",
			"pure":"high",
			"powerconv":"med"
		},
    "tech": {
      "generic": 2
    },
    "upgrades": true
	},
	"Tyne":{
		"sType":"rwH00",
		"govt":"league",
		"text":"Home of the Meklin Design Bureau, Tyne is a hub of equipment production for the League generally, and Meklin specifically. The Bureau is especially known for starships on its \"500\" platform, the Oxana and Vera, sold under the slogan \"The Best Money Alone can buy\".",
		"tech":{
      "league": 3,
      "league_civ": 3,
			"generic":3,
			"accra":2
		},
    "shipyard": true,
    "upgrades": true,
		"trade":{
			"alloy":"high",
			"dark":"high",
			"xerum":"high",
			"gas":"high",
			"ezo":"high",
			"plas":"high"
		}
	},
	"Vatsa":{
		"sType":"rwG00",
		"govt":"free",
		"tech":{
      "oe": 2,
			"generic":1
		},
    "shipyard": true,
		"text":"Vatsa's development has always been stymied by mismanagement, and as a result abandoned old-empire factories rust in fields across its temperate surface. Enough are still operated for some starships to usually be available here."
	},
	"Kopachy":{
		"sType":"onyxM1Lunar",
		"text":"Kopatchy was a moderately populous world before the empire burned off its atmosphere in 934 in the last, desperate years of its conflict with the Itaskan Peninsula. Since then the spoiled globe has stood as a memorial to the conflict which many Itaskans consider unfinished."
	},
	"DVI - Strelok":{
		"sType":"avGaruda",
		"x":75,
		"y":-143,
		"tech":{
      "itaskan": 2
		},
    "shipyard": true,
    "upgrades": true,
		"text":"One of a few on the former Empire/Itaska border, this station is part of the Itaskan territory claimed by the Loyal Suns, so it suffers from the most violent incursions. Those stationed here are battle-hardened veterans, ready to leap into starships at a moment's notice."
	},
	"Sinaqara":{
		"sType":"onyxDesertJ",
		"tech":{
			"generic":3,
			"itaskan":3
		},
    "shipyard": true,
    "upgrades": true,
		"trade":{
			"water":"high",
			"grain":"high",
			"pure":"high",
			"dark":"high",
			"xerum":"high"
		},
		"text":"An ancient homeworld, its distance from centers of conflict, Sinaqara was one of the safest planets for most of its history. However, recent Itaskan raids have given it a bad reputation."
	},
	"Kuzma":{
		"sType":"onyxDesertP",
		"scape":"img/AVDezign/Igalilik.jpg",
		"govt":"itaska",
		"tech":{
			"generic":3
		},
		"text":"One of the warmest planets on the Itaskan peninsula, the inhabitants enjoy balmy winters and and endure hotter summers. Rest assured though, as any resident will tell you, it's a dry heat."
	},
	"Cobb":{
		"sType":"gnPlanet11Maroon",
		"scape":"img/AVDezign/Faivarongo.jpg",
		"govt":"itaska",
		"text":"A lonely outpost on the border with the Loyal Suns, Cobb has many old bases but most navy activity takes place in orbit on the DIII. It is mostly a warehouse for parts, but even that function as waning as the realities of needing to launch and land large pieces of equipment sink in."
	},
	
	"DIII - Loneozner":{
		"sType":"avWusquus",
		"x":30,
		"y":100,
		"govt":"itaska",
		"text":"As far as Loyal Suns border posts go, this one is quiet. The Loyalists do not regularly skirmish in this system, and it is widely considered a backwater. Flotilla III, the flotilla based here, constantly emphasizes the feeling of dread that they experience, not knowing when the next attack will be.",
		"tech":{
			"generic":2,
      "itaskan": 2
		},
    "shipyard": true,
    "upgrades": true
	},
	"Mariposa":{
		"sType":"onyxM5Earthlike",
		"scape":"img/AVDezign/Aegir.jpg",
		"govt":"itaska",
		"x":295,
		"y":-125,
		"text":"The population center of the Albacore system. Mariposa's small size (and large oceans) lead to its population density quickly overwhelming its resources early in its history, and lead to much movement off-world. In the years since, it has been a priority of the planet's government to repair the damage done to its environment before the introduction of clean energy.",
		"tech":{
			"generic":2,
      "itaskan": 2
		},
    "shipyard": true,
    "upgrades": true,
		"trade":{
			"water":"low",
			"grain":"high",
			"pure":"med",
			"ethyl":"med"
		}
	},
	"Merced":{
		"sType":"onyxM8Red",
		"x":184,
		"y":203,
		"text":"This unremarkable moon has only one feature of interplanetary interest-it is one of the few known sources of 'Xerum', also known as red mercury. The purpose of this substance is supposed to be highly classified, but to you it's just more tonnage in the cargo bay as long as someone's buying.",
		"trade":{
			"xerum":"low"
		}
	},
	"Tuolumne":{
    "sprite": "tolumne",
		"x":-225,
		"y":-318,
		"text":"Forsaken (long, meaningful pause as the sound of the thin atmosphere whistles against your helmet) Desert"
	},
	"Yosemite":{
		"sType":"sgDrye",
		"text":"Gas giant that almost made Albacore a double star system."
	},
	"Pajit":{
		"sType":"onyxEarthlikeG",
		"scape":"img/AVDezign/Fujin.jpg",
		"govt":"itaska",
		"text":"Pajit is as aristocratic as you can really get in the peninsula, with high-tech and administrative activity during the day and lavish parties at stunning techno-villas at night. It helps that its nights last 36 hours."
	},
	"Tamt":{
		"sType":"gnPlanet13Purple",
		"scape":"img/AVDezign/Sogblen.jpg",
		"govt":"itaska",
		"text":"The technical center of the Peninsula, this is the home of the Seventh Fleet Skunk Works. Far from the border, this highly classified planet is dotted with exotic laboratories where the laws of physics are treated more as guidelines.",
		"tech":{
			"generic":3,
      "itaskan": 3
		},
    "shipyard": true,
    "upgrades": true
	},
	"MCB-1":{
		"sType":"avWusquus",
		"govt":"itaska",
		"x":-100,
		"y":-35,
		"text":"MCB-1 is an isolated station used to test weapons and technology that are too dangerous to use planetside."
	},
	"Angeles":{
		"sType":"onyxLunarV",
		"scape":"img/AVDezign/Camulos.jpg",
		"govt":"itaska",
		"text":"With no biosphere, Angeles was an ideal testbed for airtight colony technology. It was a smashing success and its population now numbers in the tens of billions. Some of the best-smelling recycled air in the galaxy can be found in the tunnels and domes here, but despite strides in hydroponic agriculture most goods need to be brought from off-world.",
		"trade":{
			"water":"high",
			"grain":"high",
			"pure":"low",
			"ethyl":"high",
			"compu":"med",
			"uacbarrels":"med"
		},
		"tech":{
			"generic":2,
      "itaskan": 2
		},
    "upgrades": true
	},
	"Izumrudnoye":{
    "sprite": "izumrudnoye",
		"scape":"img/AVDezign/Ekchuah.jpg",
		"govt":"itaska",
		"x":-10,
		"y":20,
		"text":"The methane atmosphere makes the planet unattractive except for gas mining operations. There's supposed to be enough carbon here to build another trillion humans.",
		"trade":{
			"alloy":"low",
			"pure":"med",
			"gas":"low",
			"plas":"med"
		}
	},
	"Aralsk":{
		"sType":"gnPlanet6Rock",
		"scape":"img/AVDezign/Balder.jpg",
		"govt":"itaska",
		"x":-50,
		"y":-300,
		"text":"Aralsk was dealt a crippling environmental blow at some point in its history, and is now mostly occupied by scientists who study the dried out oceans and giant tectonic fissures, hoping to discover what dread fate befell the planet, if other similarly sized worlds are at risk, and how it could be averted."
	},
	"Itaskana":{
		"sType":"gnPlanet11Maroon",
		"scape":"img/AVDezign/Yamaduti.jpg",
		"govt":"itaska",
		"text":"The center of Itaskan civilization, Itaskana is the namesake of the 'peninsula' of nebula-isolated stars that the Itaskans call home. Schoolchildren are shuttled here to see the famous parliament chambers the great stone treaties creating Itaska's government where signed, and the labs shield technology that enabled it matured. The ones that aren't irreparably irradiated anyway, because it is one of the few worlds in the peninsula so environmentally ruined that it is considered a lost cause, a victim of centuries of rapid technological progress and unchecked experiments."
	},
	"Gillespie":{
		"sType":"onyxM7Desert",
		"scape":"img/AVDezign/YumCimil.jpg",
		"govt":"itaska",
		"x":-38,
		"y":49,
		"text":"Populated since at least 200, Gillespie was a very attractive target for off-world colonization, so the landscape is a patchwork of different visions of planetary utopia. Known as the 'Great Aunt of itaskan spaceflight' since if it wasn't so close to Itaskana, they might have never had a reason to develop launch. That's got to be backwards though, because however people arrived on all of these different planets, it was by spaceflight of some description.",
    "trade": {
      "food": "high",
      "kombucha": "high"
    }
	},
	"Buttonwood":{
		"sType":"rwI01",
		"scape":"img/AVDezign/Zipakna.jpg",
		"govt":"itaska",
		"x":300,
		"y":-30,
		"text":"Over the last five hundred years, inhabitants have been moving from Itaskana to Buttonwood, due to radiation in Itaskana's seriously ionized atmosphere. It was home to the \"Buttonwood Accords\" where bans on environmentally destructive practices where put into effect throughout Itaskan space, settling what is called the \"last generational feud\" in the 330s.",
		"trade":{
			"compu":"high",
			"water":"high",
			"grain":"high",
			"alloy":"high",
			"pure":"high"
		}
	},
	"Chukchi":{
		"sType":"sgSmall",
		"scape":"img/AVDezign/Tin.jpg",
		"govt":"itaska",
		"text":"Gas giants aren't usually habitable, but Chukchi is the exception. The 'pseudomoons' in orbit are held against friction by the planet's magnetic field, protected from erosion by Scrith and Darksteel deposits."
	},
	"Sinchenko":{
		"sType":"rwP01",
		"scape":"img/AVDezign/Usas.jpg",
		"govt":"itaska",
		"x":300,
		"y":450,
		"text":"A middling planet in most respects, Sinchenko is the cultural heart of the peninsula, hosting epic concerts that draw crowds of millions on a regular basis. Entire flash-cities will show up and collectively experience the show through their Virtual Reality implants.",
		"trade":{
			"ethyl":"high",
			"spice":"high",
			"uacbarrels":"med"
		}
	},
	"Coldwater":{
		"sType":"onyxIceN",
		"govt":"free",
		"trade":{
			"water":"low",
			"grain":"med",
			"alloy":"med"
		},
		"text":"On the tense border between the Casamance Directorate and the Eastern League, coldwater's chilly landscape is listed as the most likely planet to be invaded in Casamance space. It's rumored that there are large fortresses cut into the glaciers, but the navy is quiet on the subject."
	},
  "Baikonur":{
    "govt": "loyal",
    "trade":{
      "ethyl": "high",
      "water": "low",
      "grain": "high"
    },
    "text": "Settled, if the histories are to be believed, by spacers from Itaskana, Baikonur was once the heart of a spacefaring civilization of its own, before it became the final conquest of the empire, and now cherished possession of the Loyal Suns. Perhaps as a last act of defiance, shipyards here producing old Baikonur craft still operate, and are well regarded civilian vessels.",
    "tech": {
      "generic": 2,
      "baik": 3,
      "loyal": 1
    },
    "shipyard": true,
    "upgrades": true
  },
  "Nightside": {
    "govt": "cartel",
    "trade": {
      "ethyl": "high",
      "grain": "high",
      "gas": "high"
    },
    "text": "As with any tidally locked world, Nightside rotates very slowly in relation to its parent star-in this case less than once per million years. This means that only one side of the planet has a tolerable climate-leading to its name. Far from civilization and deep in a pirate infested nebula, Nightside is the place to be if you can't be anywhere else. You can get anything here for the right price, but nobody can pay as much as the Caudron family, so they're in charge.",
    "tech": {
      "generic": 3,
      "pirate": 3,
      "cartel": 3
    },
    "shipyard": true,
    "upgrades": true
  },
  "Horizon": {
    "govt": "loyal",
    "text": "Horizon is tidally locked such that a \"day\" lasts about a hundred years, most of which is in punishing cold and darkness or unbearable heat and light. This has pushed the civilization here to adopt a nomadic lifestyle, building elaborate (and enormous) land vehicles which can relocate as the terminator moves across the surface.",
    "tech": {
      "generic": 1,
      "loyal": 1
    },
    "upgrades": true
  },
  "Broken Hill": {
    "text": "A warm, dry, dusty planet where you wouldn't expect too much wildlife. However, it's teeming with some of the deadliest creatures in the galaxy. An evolutionary arms race has lead to the development of increasingly deadly venoms and antivenoms, toxins and antidotes. It is advised that you take care while traveling here."
  },
  "Wieliczka": {
    "text": "Though the surface of Wieliczka is arid, its appearance is deceptive-its oceans are all under ground. Though not especially dense, and permeable enough for the roots of mighty trees to reach down into the brine, the surface is enough to shield the cities of Wieliczka from the harsh glare of its parent star, Rainsford."
  },
  "Krysto": {
    "text": "The low gravity of this remote, small planet is the ideal condition for propulsion research. The world is more agglomeration of comets than terrestrial planet, though bitter winds powered by tidal forces from its dim star have long since erased evidence of the ancient impacts. Extensive ice tunnels and secret bases are supposedly just below the rough, spiky surface.",
    "tech": {
      "generic": 3,
      "loyal": 2
    }
  },
  "Bukov":{
    "govt": "loyal",
    "x": 25,
    "y": 38,
    "text": "Bukov's spaceport is in the center of a blast-swept plane of green trinitite glass, surrounded by thick walls of nanocrete, and staffed by pitiless marines. This security is needed, of course, because the rest of the planet, including all of its major cities, is used as a prison by the Loyal Suns. It was discovered at some point that in some cases, such as radical Bikonour partisans (many of whom already lived on Bukov, it should be noted) it would be cheaper to cordon off an entire world than to build additional prison stations."
  },
  "Kejetia": {
    "govt": "free",
    "text": "If there's a bright center to the Casamance Freehold, this is the point that it's furthest from. Pirate raids are a regular sight in the skies over Kejetia. Attempts to contact additional civilizations or find fertile planets beyond this point have proved fruitless."
  },
  "Kufuor": {
    "govt": "free",
    "text": "Just far enough from Akosombo Nebula to avoid the worst effects, Kufuor is still a relatively harsh environment. It has earned its reputation as a waystation for ill fated explorers-no direct jump path has been discovered into the nebula from here. It is also a waystation for Casamance Navy ships hunting outlawed pirates into the frontier.",
    "tech": {
      "accra": 1,
      "generic": 1,
      "free": 1
    },
    "upgrades": true
  },
  "Broken Arrow": {
    "govt": "free",
    "text": "Broken Arrow has a warm, dry climate, perfect for many types of hardy megafauna which they heard as livestock here. Giant mechanical suits are employed by the farmers to drive the enormous beasts around (and avoid being trampled under foot.)",
    "trade": {
      "alloy": "med",
      "pure": "high",
      "scrod": "high",
      "food": "low"
    }
  },
  "Frontier Outpost III": {
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
    "govt": "free",
    "text": "This station marks not only the furthest \"southern\" extent of the old empire, but also the furthest habitation in this galactic direction. It was empty then, and it's empty now. No homeworlds have been found beyond it, and Broken Arrow was the only successful settlement in the region. The only people who go beyond are those who have nowhere else to go, desperate pirates, killers and outlaws.",
    "tech": {
      "oe": 1,
      "pirate": 2
    },
    "upgrades": true,
    "shipyard": true
  },
  "Veracruz": {
    "govt": "league",
    "text": "An ancient and expertly terraformed homeworld, Veracruz is best known as the seat of power of the Sinod of the Six - a popular but young regional faith that believes that the six hyperlanes that converge on the Kuluene system are a sign that the Great Being is going to be reincarnated somewhere on Veracruz-though as yet, no candidate messiah has passed the rigorous testing process. The Sinod is, interestingly enough, a full member of the League.",
    "trade": {
      "scriptures": "low",
      "food": "high",
      "medicine": "med"
    },
    "tech": {
      "league": 2,
      "league_civ": 3,
      "accra": 2,
      "generic": 3
    },
    "shipyard": true,
    "upgrades": true
  },
  "Quicksilver": {
    "govt": "loyal",
    "sprite": "quicksilver",
    "text": "Quicksilver is named for its brilliant mercury oceans. The winds and tides keep the surface fresh enough that it is never fully oxidized, even though its atmosphere and landmasses have a considerable amount of red rust. Metals are the name of the game here. It's not as if people would choose to live here for any other reason, though you must admit that the view of the silver ocean is stunning.",
    "trade": {
      "pure": "low"
    }
  },
  "Franconia": {
    "govt": "loyal",
    "sprite": "blue_atmo",
    "text": "Franconia's methane rich atmosphere makes it smell a bit off, but an excellent place to grow all manner of microbes. Fermented beverages are all the rage here, and you can find dozens of small vendors of beer, mead, and something called \"Komubcha\"",
    "trade": {
      "food": "low",
      "kombucha": "low",
      "pure": "high"
    }
  },
  "Vasconcells": {
    "x": 15,
    "y": -15,
    "govt": "free",
    "text": "A newly settled world, most people on Vasconcells (or at least their parents) where born on Sinquara. The Vasconcells Concern, a company which has bought up most of the liveable surface, is offering relocation vouchers for residents to come mine valuable ore here.",
    "trade": {
      "ore": "low",
      "food": "high"
    }
  },
  "Arruda": {
    "x": -15,
    "y": 15,
    "govt": "free",
    "text": "The Freehold maintains a small presence here, but with plenty of other places to put its growing population, Arruda has remained, thus far, unappealing."
  },
  "Traprain": {
    "sprite": "accra",
    "govt": "league",
    "text": "While unremarkable, though habitable world in most respects, Traprain is notable as a sort of cradle of the League's way of life. It was this world which first had its debt (public and private) bought out by a consortium of megacorporations. While in theory they still had the option of paying down the debt, for all practical purposes they had become serfs to the League. This pattern was repeated across numerous worlds, often continents at a time.",
    "tech": {
      "generic": 1,
      "league": 1
    },
    "upgrades": true
  },
  "Prospero": {
    "sprite": "accra",
    "govt": "loyal",
    "text": "A terrestrial world that may have been habitable before its parent star, Nemesis, went red-giant. Airtight stations look out over the scarred, red-bathed magma plains. What activity there is on the surface mostly work that is cheaper to do in a gravity well than in orbit, and mining the precious, heavier metals that are unusually rich on its stripped crust."
  },
  "Nemesis Orbital": {
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
    "x": 30,
    "y": 10,
    "govt": "loyal",
    "text": "The capital of Loyalist space. Seat of the Clone Prince, though it's considered poor form for them to be outside of a starship when there's conquest to be done. The current Clone Prince of the Loyal Suns has chaffed at the idea of lasting peace and taken every opportunity to skirmish with pirates and freeholders, so while it is still the bureaucratic heart of the Loyal Suns, it's become passe to actually be seen here.",
    "tech": {
      "loyal": 3,
      "generic": 3
    },
    "shipyard": true,
    "upgrades": true
  },
  "Khadir": {
    "govt": "league",
    "text": "The thin atmosphere and lack of water on Khadir have left its surface largely untouched by erosion, so the edges are sharp and the craters are plentiful. These conditions are perfect for extreme land vehicle racing, and some of the most exciting overland championships take place in Khadir's low gravity environ."
  },
  "Jagran": {
    "govt": "league",
    "text": "With rich natural and human resources, the ancient homeworld of Jagran is a major player in League politics. Its best known export is probably mid-sized starships, prized for their build quality and attention to detail. The Khanda corporation, a major League partner company is responsible for this reputation. Khanda ships can be found for sale across the galaxy but the most sensitive parts are assembled right here on Jagran.",
    "tech": {
      "league_civ": 3
    }
  },
  "Zhongshan": {
    "govt": "league",
    "text": "Perhaps unique among homeworlds, the surface of Zongshan is extremely harsh with corrosive gasses, crushing pressure, and an unbreathable atmosphere. Rather than attempt to terraform it, a decision must have been made to avoid the problem entirely. Major cities dot Zhongshan, but they employ a unique solution to the atmosphere problem-they float above the deadly clouds with lighter-than-air volumes. Rather than pouring a foundation, the construction of a new building on Zhongshan begins with 'floating' and inflating a new volume. Before the advent of interstellar trade and export, 'surface-divers' where an unfortunate necessity, and though the practice is largely gone there is still quite a bit of pride among those who can trace their ancestry back to those who braved the death-clouds at the surface.",
    "trade": {
      "alloy": "high",
      "grain": "high"
    }
  },
  "Hoosac":{
    "govt": "loyal",
    "text": "A geologically active world may not be dangerous for the obvious reasons. While earthquakes and eruptions certainly pose threats, the ash clouds that cover the sky and uneroded badlands that scar the surface are the real thorn in the side of Loyal Suns marines stationed here. Generations of guerilla warfare have hardened the hearts and hands of the people who still cling to independence here. It is widely considered to be ungovornable, as the long line of unfortunate planetary governors will tell you.",
    "trade": {
      "small_arms": "high"
    }
  },
  "Hoosac Orbital":{
    "sprite": "oe_station", 
    "img": "assets/landing/oe_station_perspective.png",
    "x": 10,
    "y": 3,
    "govt": "loyal",
    "text": "To say that Housatonic is considered a bad post is an understatement. The surface is so treacherous that to keep a foothold, they've constructed an entire station to support ground bases. Fat lot of good it does, however, when an eruption makes orbital drop and recovery impossible.",
    "tech": {
      "loyal": 1,
      "generic": 1
    },
    "upgrades": true
  },
  "Agra": {
    "x": -7,
    "y": 5,
    "govt": "league",
    "trade": {
      "food": "low"
    },
    "text": "Agra's reputation is built almost entirely on food. There is plenty of produce for export, of course, but any local will tell you that the very best way to consume that produce is on-world, at one of the many fine eating establishments. The trick is the spices, sourced (again, locally) from equatorial environs and brought by heavy-lift airship to the spaceports of the northern pole, where the capital is located."
  },
  "Reddy":{
    "x": 3,
    "y": -6,
    "govt": "league",
    "text": "Reddy is a small, low-gravity backwater world. Unable to trap an atmosphere, Reddy's cities are under brilliant domes which are lit different colors for various festivals and can be seen from the sky like little ornaments."
  },
  "Morcia": {
    "govt": "loyal",
    "text": "There are two distinct civilizations on Morcia, frequently at each other's throats. One of them, the one you can land and trade at, has contact with the outside galaxy and is aligned with the Loyal Suns. The other, reclusive civilization has resisted direct dealings with spacefarers thus far."
  },
  "Petrov": {
    "x": 14,
    "y": 25,
    "govt": "league",
    "trade": {
      "ore": "low",
      "food": "high",
      "ethyl": "med"
    },
    "text": "Long before first contact, Petrov had a fairly well-off civilization going. Explorers arrived to find an irradiated, ruined world bearing the apparent scars of nuclear self-immolation, rendering the biosphere void of all vertebrate life. The spaceport here mostly serves 'Stalkers' or opportunistic adventurers, archaeologist, and looters who scour the crumbling ruins and charred fields for evidence of what went so wrong, or just something valuable."
  },
  "Prokhoro": {
    "x": 32,
    "y": -3,
    "govt": "league",
 		"tech":{
			"lg_ship":3,
			"khanda":1,
			"melkin":3
    },
    "text": "A backwater station kept on its toes by the occasional Fifth Fleet raid trying to pass through. Probably a better place to refuel in-system since the planet surface is still pretty irradiated."
  },
  "Akindele": {
    "govt": "free",
    "text": "When you buy or sell something on the open market, you don't barter your goods, you use credcoins. Mercs and pirates alike kill for Credcoin. And it's a cryptocurrency, so why are there large 'Galactic Bank' buildings dotting the landscape here? The reason is what's referred to as the 'sync problem.' If you spend some credcoin on Accra, how can you be sure that someone didn't spend the same coin on Kimathi? Trade moves faster than light in the galaxy, and the only thing that can move faster than light is a ship with a sidereal drive. Galactic Bank has carved a niche for itself updating these ledgers in all but the most war torn of systems, effectively centralizing something that was designed from the beginning to be uncontrollable."
  },
  "Shorunmu": {
    "govt": "free",
    "text": "Shorunmu University is the most famous biology and medical tech hub in the galaxy. If you ever need a limb regrown (or even just reattached) the doctors here would be only too happy to oblige. Cloning technology perfected here enabled the creation of 'germlines'- individuals so wealthy and powerful that they could afford to clone themselves to continue their dynasty. Some germlines date back to the creation of the Old Empire, and of course the current Clone Prince of the Loyal Suns is an example. In current Freehold society, it's considered a bit pretentious to say that you're a clone (or, worse, part of a famous germline) so most keep it to themselves."
  },
  "Dealer's End": {
    "govt": "loyal",
    "text": "Kelly Dealer was a famous explorer in the 800s, and this colony is named in her honor. It commemorates the greatest western extent of her exploration, that much is known for sure. It is also said that when she arrived she found something here that told her that she was done and that nothing useful would be found further west. What that was appears to be lost to history."
  },
  "Courthope Reef": {
    "govt": "league",
    "sprite": "reef",
    "text": "When league scouts first reached Courthope Reef, they assumed that they where about to make first contact with some far flung civilization. However, if it was a station, it was abandoned. And the jury is still out on if it's a station at all-some even theorize that it represents the empty shell of some enormous long-dead (or, worse, dormant or absent) organism.\n Regardless of its origin, the 'Reef' is now a hotly contested commodity because it is the only economical source of a very useful substance called Catalite. As the only known reserve of the substance, it's actually worth braving the journey back through pirate-infested space.",
    "trade":{
      "metal": "high",
      "grain": "high",
      "ore": "high",
      "catalite": "low"
    }
  },
  "Koungheul": {
    "govt": "free",
    "sprite": "koungheul",
    "text": "Koungeul has emerged as the destination for Catalite traders, with many refineries on the planet benefitting from the boom. It's a tough business, of course, since it needs to be transported all the way from the Courthope Reef to here (and then turned into various products for sale throughout the Freehold.)",
    "trade": {
      "ore": "low",
      "catalite": "high"
    },
    "shipyard": true,
    "custom": true,
    "tech":{
			"accra":3,
			"generic":2,
			"free":2
    }
  },
  "Miranda": {
    "govt": "league",
    "sprite": "miranda",
    "text": "The League's main port for Catalite. In the midst of an economic expansion due to the League's recent control of the Courthope Reef that has lead to several major promotions.",
    "trade": {
      "catalite": "high"
    }
  }

}
