{
  "nocargoexp":{
    "name"           : "Optimal Cargo Space",
    "space"          : 0,
    "desc"           : "This ship is already optomized for cargo room; no more space can be converted to cargo capacity.",
    "price"          : 0,
    "exclass"        : "nocargoexp",
    "locked"         : true
  },
  "nospaceexp":{
    "name"           : "Optimal Upgrade Space",
    "space"          : 0,
    "desc"           : "This ship is already optomized for upgrade space; no more cargo room can be converted to free space.",
    "price"          : 0,
    "exclass"        : "nospaceexp",
    "locked"         : true
  },
  "plasma50": {
    "name"           : "Plasma Cannon 50kj",
    "space"          : -5,
    "desc"           : "This energy weapon dates back to at least before the sector was settled, and perhaps even earlier. Versions of it have been seen on many worlds, but it was standardized and mass produced by the Empire. It propels a high-energy shaped plasma burst at the target, maximizing damage and using very little energy. However it quickly dissipates and its damage potential diminishes over time. It is best used at close range.",
    "price"          : 500,
    "weapon"      : {
      "mesh":  "plasma_cannon",
      "sprite": "plasma",
      "miss": 0.1,
      "cooldown": 500,
      "velocity": 0.001,
      "proj": {
        "damage": 1,
        "shield_damage": 2,
        "max_age": 5000,
        "collider": {"radius": 0.3}
      }
    },
    "tech"           : {"oe_wep":1}
  },
  "plasma200":{
    "name"           : "Plasma Cannon 200kj",
    "space"          : -25,
    "desc"           : "Approxmiately four times as powerful as the standard cannon, the type 400 200kj plasma turret is mounted on most larger civilian ships, as its military use has been eclipsed by more powerful and efficient cannons. Still, if you haven't got a navy at your back, it does not hurt to be packing a 200.",
    "price"          : 2500,
    "weapon"         : {
      "sprite": "plasma_large",
      "miss": 0.05,
      "cooldown": 1500,
      "velocity":0.001,
      "proj": {
        "shield_damage": 60,
        "damage": 30,
        "max_age":8000,
        "collider": {"radius": 1.2}
      }
    },
    "tech"           : {"oe_wep":2}
  },
  "goldarmor":{
    "name"           : "Nanite Armor",
    "space"          : -1,
    "desc"           : "Arguably the most advanced armor available, it is used extensively by the 7th fleet, as evedenced by the gleaming gold color of their hulls. Though not the absolute most protection pound-for-pound, it is unique in its ability to self-repair damage over time.",
    "price"          : 6000,
    "hullRegen"      : 10,
    "tech"           : {"itaskan_wep":2}
  },
  "autocannon":{
    "name"           : "20mm Autocannon",
    "space"          : -3,
    "desc"           : "An elegant weapon, from a less civilized age. the 20mm autocannon is a close combat weapon due mainly to its inaccuracy. It fires high-explosive, armor piercing shells at high velocities, propelled through eight barrels. It is often used as a cheap close-in weapon, after plasma cannons have been used to strip away shields, as it is more efficient at penitrating armor (having been perfected long before energy shields ever where.",
    "price"          : 500,
    "exclass"        : "autocannon",
    "weapon"      : {
      "sprite":"autocannon",
      "velocity":0.035,
      "miss":0.5,
      "cooldown":50,
      "burstsize":20,
      "burstcooldown":500,
      "ammo":"autocannonammo",
      "proj": {
        "shield_damage":1,
        "damage":5,
        "max_age":100000,
        "collider": {"radius": 0.1}
      }
    },
    "tech"           : {"oe_wep":1}
  },
  "autocannonammo":{
    "name"           : "20mm Shells",
    "space"          : -0.01,
    "desc"           : "Autocannon shells are compact containers for an explosive warhead and propellant. The propellant is ignited inside the barrel by electromagnetic induction outside it, leaving behind no case to eject (or make the ammo heavier.)",
    "price"          : 10,
    "require"        : "autocannon",
    "tech"           : {"oe_wep":1}
  },
  "ejectorrack":{
    "name"           : "Missile Ejector Rack",
    "space"          : -0.1,
    "desc"           : "Ejector rack and pylon for basic missiles, various types of which are sold throughout the sector, mounted standard on Emperial fighters since 400. The mount is simple enough to have changed little in the interviening years, though the missiles have become more powerful and sophisticated.",
    "price"          : 1000,
    "exclass"        : "ejectorrack",
    "weapon"      : {
      "sprite":"autocannon",
      "velocity":0.035,
      "miss":0.01,
      "cooldown": 10,
      "ammo":"dumbfiremissile",
      "proj": {
        "shield_damage":10,
        "damage":10,
        "max_age":100000,
        "collider": {"radius": 0.2}
      }
    },
    "tech"           : {"oe_wep":2}
  },
  "dumbfiremissile":{
    "name"           : "Dumb fire missile",
    "space"          : -1,
    "desc"           : "Attaches to a standard ejector missile rack, and totally unguided. A simple missile design used to give small ships that extra punch.",
    "price"          : 100,
    "require"        : "ejectorrack",
    "tech"           : {"oe_wep":1}
  },
  "guidedmissile":{
    "name"           : "Guided missile",
    "space"          : 1,
    "desc"           : "Similar to more common dumb fire missiles, but slightly more complex to produce. It locks onto a target with its own internal insturments, and needs no input from the ship once fired. However, due to space constraints, it has less damage potential then the dumb fire version.",
    "price"          : 200,
    "require"        : "ejectorrack",
    "ammotype"       : "erguided",
    "tech"           : "oewep2"
  },
  "dragnet":{
    "name"           : "Dragnet Antifighter",
    "space"          : -6,
    "desc"           : "The \"Dragnet\" point defense solution is used almost exclusively by pirates. It consists of a light tractor beam, able only to do non-lethal damage to hulls (but stronger against shields). Pirate warshis can then steal the fighters captured by the turrets. As a point defense weapon, however, it has one critical flaw-it cannot destroy incoming projectiles, and isn't even configured to fire on them-it would simply pull them towards the ship.",
    "price"          : 25000,
    "weapon"         : {
      "miss":0,
      "cooldown":0.2,
      "beam": {
        "shield_damage":40,
        "damage":30,
        "disabler" : true,
        "length":40
      }
    },
    "tech"           : {"pirate":3}
  },
  "turners":{
    "name"           : "Supplimental Thrusters",
    "space"          : -1,
    "desc"           : "Additional thrusters increase a ship's rotation speed. Effectiveness is proportional to the ship's length and inversely proportional to ship mass and moment of inertia.",
    "price"          : 10000,
    "rotation"       : 0.01,
    "tech"           :  {"generic":3}
  },
  "jammer":{
    "name"           : "Missile Jammer",
    "space"          : -1,
    "desc"           : "A powerful radio dish that confuses incoming missiles by flooding the area with radiation.",
    "price"          : 30000,
    "missile_jam_factor": 10,
    "tech"           : {"generic":3}
  },
  "cargoupg":{
    "name"           : "Cargo Upgrade",
    "space"          : -12,
    "cargo"          : 10,
    "desc"           : "Weapons space can be retooled into cargo space, but with a slight (20%) loss.",
    "price"          : 15000,
    "require"        : "!nocargoexp",
    "tech"           : {"generic":2}
  },
  "spaceupg":{
    "name"           : "Space Upgrade",
    "cargo"          : -12,
    "space"          : 10,
    "desc"           : "Cargo space can be retooled into weapons and outfit space, but with a slight (20%) loss.",
    "price"          : 15000,
    "require"        : "!nospaceexp",
    "tech"           : {"generic":2}
  },
  "antigun":{
    "name"           : "Antimatter Autocannon",
    "space"          : -8,
    "desc"           : "The propulsion for this cannon is generated entirely by forcefields, because it is critical that the ammunition never actually touch the barrel. When the projectiles strike a ship's hull, they annhilate it, carving a hole and melting the surrounding plating with intense radiation. Unfortunately, the weapon is useless against shields because its velocity and weight aren't high enough to make a dent (prescisely why sheilds are used to protect the barrel!)",
    "price"          : 100000,
    "weapon"         : {
      "miss":0.07,
      "ammo":"antigunammo", 
      "sprite":"antimatter",
      "velocity":0.0005,
      "miss":0.4,
      "cooldown":50,
      "burstsize":20,
      "burstcooldown":10000,
      "proj":{
        "shield_damage":0,
        "damage":25,
        "max_age":100000,
        "bounce_off_shields": true,
        "collider": {"radius": 1.2}
      }
    },
    "tech"           : {"antimatter":2}
  },
  "antigunammo":{
    "name"           : "0.01mm AM Shells",
    "space"          : -0.02,
    "desc"           : "The shells fired by antimatter autocannons are generally formed out of antilead (for density and stability). The ammo is stored in shielded shell casings which also store enough power to propel the projectile and are discareded out the end of the barrel like sabots.",
    "price"          : 10,
    "require"        : "antigun",
    "tech"           : {"antimatter":1}
  },
  "fuelpod":{
    "name"           : "Fuel Pod",
    "space"          : -2,
    "desc"           : "A fuel tank that can carry enough fuel for another jump. Excellent for ships using weapons that draw from the main power supply?",
    "price"          : 3000,
    "max_fuel"       : 1,
    "tech"           :{"generic":1}
  },
  "fighterbay":{
    "name"           : "Fighter Launch Bay",
    "space"          : -20,
    "desc"           : "The key component of this upgrade is an enormous airlock for launching ships, and an area large enough to house them. Areas to store and service the ships are added seperately, and additional launch bays can be added to facilitate faster launching.",
    "price"          : 10000,
    "fighterbay"     : true,
    "fightercooldown": 1,
    "tech"           : {"generic":2}
  },
  "degengun":{
    "name"           : "0.0001mm Degenerate Matter Cannon",
    "space"          : -6,
    "desc"           : "Degenerate matter projectiles are favored for various reasons-especially that they can be formed out of space dust. The Original intention was to fire a super-dense projectile in an effort to penitrate shields, forcing the shield to concentrate its energy in a very small area to defeat the projectile, which is damaging to them. It is also able to hold massive amounts of heat for its volume, and releases irradiating nutrons and alpha particles as it dissipates. The drawback is that coalescion fields (similar to the ones employed by plasma guns) cannot contain the degenerate matter for long, so the cannon's range is severely limited.",
    "price"          : 100000,
    "weapon"         : {
      "sprite":"degenerate",
      "velocity":0.0035,
      "miss":0.3,
      "cooldown":25,
      "burstsize":20,
      "burstcooldown":10000,
      "proj": {
        "max_age":700,
        "shield_damage":10,
        "damage":25
      }
    },
    "tech"           : {"itaskan":1}
  },
  "sling": {
    "name"           : "10mm Shield-exclusion sling",
    "space"          : -10,
    "desc"           : "Works much like a force shield, but in reverse. When charged, the generators force a projectile out of a narrow channel where it picks up enough speed to have a devastating impact by the end. Very effective at long range against slow ships, but won't be able to tag faster fighters since it's an unguided projectile.",
    "price"          : 15000,
    "weapon":        {
      "sprite" : "sling",
      "miss": 0.001,
      "cooldown": 4000,
      "velocity": 0.001,
      "proj": {
        "shield_damage": 50,
        "damage": 100,
        "max_age": 10000,
        "collider": {"radius": 2}
      } 
    },
    "tech"           : {"itaskan": 2}
  },
  "quarkgun":{
    "name"           : "One Mole Quarkgun",
    "space"          : -10,
    "price"          : 10000,
    "tech"          : {"wsc": 1},
    "desc"          : "Using a stabilized payload of like-colored quarks, the projectile from this weapon is attached to the target by gluons, which singshot it with devastating force. If it manages to make contact with a target's hull, the now free quarks will play havoc with its atomic structure, causing unpredictable (but always devastating) damage. A curious side effect of the strong-force \"guidance\" is that the further away the target is when the projectile is launched, the more damage it will do.",
    "weapon"        : {
      "sprite": "gluon",
      "miss": 0.05,
      "cooldown": 1500,
      "velocity":0.001,
      "guidance": true,
      "proj": {
        "rotation": 0.01,
        "accel": 0.01,
        "shield_damage": 60,
        "damage": 30,
        "max_age":8000,
        "collider": {"radius": 1.2}
      }
    }
  },

  "vampgun":{
    "name": "Wave Siphon",
    "tech"          : {"wsc": 2},
    "weapon"         : {
      "miss":0,
      "cooldown":0.001,
      "beam": {
        "shield_damage":50,
        "damage":0,
        "length":30,
        "recharge_parent_shields": 0.8
      }
    },
    "price"         : 100000,
    "desc"          : "Faced with the problem of shields, and not to be outdone, the WSC have deployed a dedicated anti-shield weapon across its fleet. It requires getting to knife fight range, but the reward is that for every kilowatt of shields drained from a target, the Siphon can recharge the ship's shields by .8kw, an impressive ratio. It is, of course, totally ineffectual against armor."
  },
  "wsc_armor":{
    "name"           : "Monoparticulate Plate",
    "tech"           : {"wsc": 2},
    "price"          : 10000,
    "desc"          : "Formed as a single nucleaon, each (assuredly macro-scopic) plate of this armor is held together by the same force that holds protons and neutrons together. The toughest armor in the known galaxy. Has a tendancy to get blown clean off rather than fracture. Though when it does fracture, it tends to take everything nearby with it.",
    "armor"          : 1000,
    "explodamage"    : 1000
  },
  "cas_blink":{
    "name"           : "Casamance Microdrive",
    "tech"           : {"cas": 6},
    "price"          : 10000,
    "space"          : -5,
    "blink"          : 1,
    "desc"           : "Groundbreaking research has unlocked the secret of in-system jumps for dogfighting"
  },
  "ne_beam":{
    "name"           : "Induction Beam",
    "tech"           : {"ne": 6},
    "price"          : 800,
    "space"          : -6,
    "weapon"         : {
      "miss": 0.1,
      "cooldown":0.001,
      "beam": {
        "shield_damage":20,
        "damage":20,
        "length":45,
        "reflect": true
      }
    },
    "desc"           : "Your standard electrostatic discharge which overwhelms shields by cooking the generator. Simple, right? Wrong-a happy accident, it turns out that it can essentially turn the target's shields into a projector for the same sort of beam. With careful tuning, this lead to the capability of bouncing the beam off the initial target and on to further targets. This acts as a force multiplier, allowing a smaller number of fighters to face down more numerous foes."
  },
  "ion_cannon_50":{
    "name"          : "Ion cannon, 50 Coulomb",
    "tech"          : {"pirate": 2},
    "price"          : 1200,
    "space"          : -5,
    "weapon"      : {
      "sprite": "ion",
      "miss": 0.1,
      "cooldown": 500,
      "velocity": 0.001,
      "proj": {
        "damage": 1,
        "shield_damage": 2,
        "max_age": 5000,
        "collider": {"radius": 0.3},
        "ionize": 1
      }
    },

    "desc"           : "Designed to disrupt a ship's critical systems, ion weapons are a favorite of discriminating pirates. A high risk/high reward play, an ion weapon won't take a foe out of the fight nearly as quickly as, say, hot plasma. It will, however, ionize the target ship, which will trash a ship's reactors, some engines and weapons, leaving them dead in the water-perfect prey for pirates."
  },
  "ion_cannon_200":{
    "name"           : "Ion Cannon, 200 Coulomb",
    "tech"           : {"pirate": 2},
    "price"          : 4800,
    "space"          : -22,
    "weapon"         : {
      "sprite": "ion_large",
      "miss": 0.05,
      "cooldown": 1500,
      "velocity":0.001,
      "proj": {
        "shield_damage": 60,
        "damage": 30,
        "max_age":8000,
        "collider": {"radius": 1.2}
      }
    },

    "desc"           : "A turreted, large bore version of the ion cannon. Its operation is similar to a plasma cannon of similar description, but rather than superheating the plasma in the chamber, it's modified to ionize the plasmaas much as possible."
  },
  "mining_laser":{
    "name"           : "Mining Laser, 50gw",
    "tech"           : {"xic": 2},
    "price"          : 50000,
    "space"          : -20,
    "weapon"         : {
      "miss": 0,
      "cooldown":0.001,
      "beam": {
        "shield_damage":20,
        "damage":60,
        "length":8
      }
    },
    "desc"           : "A core component of the XIC drillship is its powerful mining laser. It can be tuned specifilly to maximize energy delivery to the target asteroid. As always, excercise caution while mining operations are being conducted. Eye protection suggested."
  }
}  

