{
  "plasma50": {
    "name"           : "Plasma Cannon 50kj",
    "space"          : -5,
    "desc"           : "This energy weapon dates back to at least before the sector was settled, and perhaps even earlier. Versions of it have been seen on many worlds, but it was standardized and mass produced by the Empire. It propels a high-energy shaped plasma burst at the target, maximizing damage and using very little energy. However it quickly dissipates and its damage potential diminishes over time. It is best used at close range.",
    "price"          : 500,
    "weapon"      : {
      "mesh":  "plasma_cannon",
      "skin":  "plasma",
      "sprite": "plasma",
      "inaccuracy": 0.09,
      "period": 500,
      "velocity": 0.04,
      "proj": {
        "force": 0.5,
        "explosion": "plasma_impact_small",
        "damage": 10,
        "shield_damage": 20,
        "max_age": 5000,
        "collider": {"notunnel": true}
      }
    },
    "tech"           : {"oe":1}
  },
  "plasma200":{
    "name"           : "Plasma Cannon 200kj",
    "space"          : -25,
    "desc"           : "Approximately four times as powerful as the standard cannon, the type 400 200kj plasma turret is mounted on most larger civilian ships, as its military use has been eclipsed by more powerful and efficient cannons. Still, if you haven't got a navy at your back, it does not hurt to be packing a 200.",
    "price"          : 2500,
    "weapon"         : {
      "mesh":  "plasma_cannon_large",
      "skin":  "plasma",
      "sprite": "plasma_large",
      "inaccuracy": 0.08,
      "period": 2000,
      "velocity":0.04,
      "proj": {
        "force": 25,
        "explosion": "plasma_impact",
        "shield_damage": 60,
        "damage": 30,
        "max_age": 4000,
        "collider": {"notunnel": true}
      }
    },
    "tech"           : {"oe":2}
  },
  "goldarmor":{
    "name"           : "Nanite Armor",
    "space"          : -1,
    "desc"           : "Arguably the most advanced armor available, it is used extensively by the 7th fleet, as evidenced by the gleaming gold color of their hulls. Though not the absolute most protection pound-for-pound, it is unique in its ability to self-repair damage over time.",
    "price"          : 6000,
    "hullRegen"      : 10,
    "tech"           : {"itaska":2}
  },
  "autocannon":{
    "name"           : "25mm Autocannon",
    "space"          : -3,
    "desc"           : "An elegant weapon, from a less civilized age. Similar arms have been used since before modern spaceflight, and if it isn't broken, don't fix it. The 25mm autocannon is a close combat weapon due mainly to its inaccuracy. It is often used as a cheap close-in weapon, after plasma cannons have been used to strip away shields, as it is more efficient at busting armor (having been perfected long before energy shields ever where.)",
    "price"          : 500,
    "exclass"        : "autocannon",
    "weapon"      : {
      "mesh":  "plasma_cannon",
      "sprite":"autocannon",
      "velocity":0.035,
      "inaccuracy":0.3,
      "period":100,
      "burst_size":5,
      "burst_period":1000,
      "ammo":"autocannonammo",
      "proj": {
        "force": 0.1,
        "explosion": "ac_impact",
        "shield_damage":5,
        "damage":15,
        "max_age":1000,
        "collider": {"notunnel":true}
      }
    },
    "tech"           : {"oe":1}
  },
  "autocannonammo":{
    "name"           : "25mm Shells",
    "space"          : -0.01,
    "desc"           : "Autocannon shells are compact containers for an explosive warhead and propellant. The propellant is ignited inside the barrel by electromagnetic induction outside it, leaving behind no case to eject (or make the ammo heavier.)",
    "price"          : 10,
    "require"        : "autocannon",
    "tech"           : {"oe":1}
  },
  "ejectorrack":{
    "name"           : "Missile Ejector Rack",
    "space"          : -0.1,
    "desc"           : "Ejector rack and pylon for basic missiles, various types of which are sold throughout the sector, mounted standard on Starfighters as far back as the year 400. The mount is simple enough to have changed little in the intervening years, though the missiles themselves have become more powerful and sophisticated.",
    "price"          : 1000,
    "exclass"        : "ejectorrack",
    "weapon"      : {
      "mesh":  "plasma_cannon",
      "sprite":"missile",
      "velocity":0.035,
      "inaccuracy":0.01,
      "period": 500,
      "ammo":"dumbfiremissile",
      "proj": {
        "force": 10,
        "shield_damage":30,
        "damage":50,
        "max_age":4000,
        "collider": {"notunnel": true}
      }
    },
    "tech"           : {"oe":2}
  },
  "dumbfiremissile":{
    "name"           : "Dumb fire missile",
    "space"          : -1,
    "desc"           : "Attaches to a standard ejector rack, and totally unguided. A simple missile design used to give small ships the ability to punch up, and hit (slow) targets at long range.",
    "price"          : 100,
    "require"        : "ejectorrack",
    "tech"           : {"generic": 1}
  },
  "guidedmissile":{
    "name"           : "Guided missile",
    "space"          : 1,
    "desc"           : "Similar to more common dumb fire missiles, but slightly more complex to produce. It locks onto a target with its own internal instruments, and needs no input from the ship once fired. However, due to space constraints, it has less damage potential then the dumb fire version.",
    "price"          : 200,
    "require"        : "ejectorrack",
    "ammotype"       : "erguided",
    "tech"           : {
      "generic": 1 
    }
  },
  "dragnet":{
    "name"           : "Dragnet Antifighter",
    "space"          : -6,
    "desc"           : "The \"Dragnet\" point defense solution is used almost exclusively by pirates. It consists of a light tractor beam, able only to do non-lethal damage to hulls (but stronger against shields). Pirate warships can then steal the fighters captured by the turrets. As a point defense weapon, however, it has one critical flaw-it cannot destroy incoming projectiles, and isn't even configured to fire on them-it would only make matters worse by dragging projectiles towards the ship!",
    "price"          : 25000,
    "weapon"         : {
      "mesh":  "plasma_cannon",
      "skin": "ion",
      "inaccuracy":0,
      "period":0.001,
      "beam": {
        "graphics": {
          "type": "tube",
          "radius": 0.2,
          "color": [0.4, 0.7, 0.4],
          "emissive_color": [0.1, 0.1, 0.7]
        },
        "explosion": "ion_impact_small",
        "force": -10,
        "shield_damage":40,
        "damage":30,
        "disabler" : true,
        "length":20
      }
    },
    "tech"           : {"pirate":3}
  },
  "turners":{
    "name"           : "Supplimental Thrusters",
    "space"          : -1,
    "desc"           : "Additional thrusters increase a ship's rotation speed. Effectiveness is proportional to the ship's length and inversely proportional to ship mass and moment of inertia.",
    "price"          : 10000,
    "rotation"       : 0.01,
    "tech"           :  {"generic":3}
  },
  "jammer":{
    "name"           : "Missile Jammer",
    "space"          : -1,
    "desc"           : "A powerful radio dish that confuses incoming missiles by flooding the area with distracting signals.",
    "price"          : 30000,
    "missile_jam_factor": 10,
    "tech"           : {"generic":3}
  },
  "cargoupg":{
    "name"           : "Cargo Upgrade",
    "space"          : -12,
    "cargo"          : 10,
    "desc"           : "Weapons space can be retooled into cargo space, but with a slight (20%) loss.",
    "price"          : 15000,
    "tech"           : {"generic":2}
  },
  "spaceupg":{
    "name"           : "Space Upgrade",
    "cargo"          : -12,
    "space"          : 10,
    "desc"           : "Cargo space can be retooled into weapons and outfit space, but with a slight (20%) loss.",
    "price"          : 15000,
    "tech"           : {"generic":2}
  },
  "antigun":{
    "name"           : "Antimatter Autocannon",
    "space"          : -8,
    "desc"           : "This deadly variation on the autocannon concept fires minute globs of antimatter, the inverse-charged counterpart to the matter that makes up most of the galaxy. When the projectiles strike a ship's hull (as goes any matter/antimatter contact), they annihilate, carving a hole and melting the surrounding plating with intense radiation. Unfortunately, the weapon is ineffective against shielded targets-in fact, a shield is used inside the barrel to prevent any contact between the weapon and the ammunition.",
    "price"          : 100000,
    "weapon"         : {
      "mesh":  "plasma_cannon",
      "inaccuracy":0.07,
      "ammo":"antigunammo", 
      "sprite":"antimatter",
      "velocity":0.0005,
      "inaccuracy":0.4,
      "period":50,
      "burstsize":20,
      "burstperiod":10000,
      "proj":{
        "force": 5,
        "shield_damage":0,
        "damage":25,
        "max_age":100000,
        "bounce_off_shields": true,
        "collider": {"notunnel": true}
      }
    },
    "tech"           : {"loyal":2}
  },
  "antigunammo":{
    "name"           : "0.01mm AM Shells",
    "space"          : -0.02,
    "desc"           : "The shells fired by antimatter autocannons are generally formed out of antilead (for density and stability.) The process is very expensive and the power/space requirements ensure that it will be mostly done planetside for some time to come. The ammo is stored in shielded shell casings which also store enough power to propel the projectile and are discarded out the end of the barrel like sabots.",
    "price"          : 10,
    "require"        : "antigun",
    "tech"           : {"loyal":1}
  },
  "fuelpod":{
    "name"           : "Fuel Pod",
    "space"          : -2,
    "desc"           : "You can think of the galaxy and everything in 3d space as sitting on a soap bubble. Higher dimensions are outside the bubble, lower dimensions are inside the bubble. In order to move faster than light, you push yourself lower, go somewhere, then push yourself back up. But you can't just fling any old matter out into 5d space-it needs to be specially entangled and stored with care in a properly shielded tesseract.",
    "price"          : 3000,
    "max_fuel"       : 1,
    "tech"           :{"generic":1}
  },
  "fighterbay":{
    "name"           : "Fighter Launch Bay",
    "space"          : -20,
    "desc"           : "This upgrade includes massive airlocks, hangers, and associated kit to keep and launch a squadron of spacefighters.",
    "price"          : 10000,
    "fighterbay"     : true,
    "fighterperiod": 1,
    "tech"           : {"generic":2}
  },
  "degengun":{
    "name"           : "0.0001mm Degenerate Matter Cannon",
    "space"          : -6,
    "desc"           : "Sort of the ideal blend of plasma cannon and autocannon. The projectile is held together by a self-sustained field, (like a plasma weapon) but is itself solid and prone explode on impact (like an autocannon.) The field holding it together is so tight that the only thing keeping it from getting smaller is 'degeneracy pressure' - the inability of identical particles to occupy the same space at the same time. An edge case in the universe, some might say.",
    "price"          : 100000,
    "weapon"         : {
      "mesh":  "plasma_cannon",
      "sprite":"degenerate_matter",
      "velocity":0.035,
      "inaccuracy":0.3,
      "period": 125,
      "burstsize":5,
      "burstperiod":1000,
      "proj": {
        "explosion": "ac_impact",
        "force": 10,
        "max_age":700,
        "shield_damage":8,
        "damage":25,
        "collider": {"notunnel": true}
      }
    },
    "tech"           : {"itaskan":1}
  },
  "quarkgun":{
    "name"           : "One Mole Quarkgun",
    "space"          : -10,
    "price"          : 10000,
    "tech"          : {"itaska": 1},
    "desc"          : "Using a stabilized payload of like-colored quarks, the projectile from this weapon is attached to the target by gluons, which slingshot it with devastating force. If it manages to make contact with a target's hull, the now free quarks will play havoc with its atomic structure, causing unpredictable (but always devastating) damage. A curious side effect of the strong-force \"guidance\" is that the further away the target is when the projectile is launched, the more damage it will do on impact.",
    "weapon"        : {
      "mesh":  "plasma_cannon",
      "sprite": "gluon",
      "inaccuracy": 0.05,
      "period": 1500,
      "velocity":0.001,
      "proj": {
        "guided": true,
        "force": -20,
        "rotation": 0.01,
        "accel": 0.00006,
        "shield_damage": 30,
        "damage": 10,
        "max_age":8000,
        "max_speed": 0.08,
        "scale_damage_with_velocity": true,
        "collider": {"notunnel":true}
      }
    }
  },

  "vampgun":{
    "name": "Wave Siphon",
    "tech"          : {"itaska": 2},
    "weapon"         : {
      "mesh":  "plasma_cannon",
      "inaccuracy":0,
      "period":0.001,
      "beam": {
        "force": -1,
        "graphics": {
          "type": "tube",
          "radius": 0.2,
          "color": [1.5, 0.5, 0.8],
          "emissive_color": [1.4, 0.4, 0.7]
        },
        "shield_damage":50,
        "damage":0,
        "length":30,
        "recharge_parent_shields": 0.8
      }
    },
    "price"         : 100000,
    "desc"          : "Faced with the problem of shields, and not to be outdone, the League have deployed a dedicated anti-shield weapon across its fleet. It requires getting to knife fight range, but the reward is that for every kilowatt of shields drained from a target, the Siphon can recharge the ship's shields by .8kw, an impressive ratio. It is, of course, totally ineffectual against armor."
  },
  "cas_blink":{
    "name"           : "Freehold Microdrive",
    "tech"           : {"free": 3},
    "price"          : 10000,
    "space"          : -5,
    "blink"          : 1,
    "desc"           : "Everyone knows that cross-dimensional, faster-than-light navigation is only possible when three conditions are met: the ship is free from nearby stellar-scale gravity wells ('flat space') the exit point into reality is close to a gravity well ('falling out') and, the most enigmatic constraint, the 'sidereal effect' or 'chasing your tail', you need to be well outside of your own original lightcone or Very Bad Things happen. It seemed like a constant of the universe, and that cause and effect may prove violable if it where broken. Provocatively, the scientists at Alluvium called it the 'sidereal barrier' and set to work on it. This is the result - the microdrive will let you instantaneously jump through a system, avoiding projectiles and confusing your enemies. Impressive amount of work for what amounts to a parlor trick."
  },
  "ne_beam":{
    "name"           : "Induction Beam",
    "tech"           : {"loyal": 2},
    "price"          : 800,
    "space"          : -6,
    "weapon"         : {
      "mesh":  "plasma_cannon",
      "period":0.5,
      "beam": {
        "force": 1,
        "graphics": {
          "type": "tube",
          "radius": 0.1,
          "color": [0.8, 0.8, 1],
          "emissive_color": [0.5, 0.5, 1]
        },
        "length":30,
        "shield_damage":120,
        "damage":25,
        "length":25
      }
    },
    "desc"           : "Your standard electrostatic discharge which overwhelms shields by cooking the generator. Simple, right? Wrong-a happy accident, it turns out that it can essentially turn the target's shields into a projector for the same sort of beam. With careful tuning, this lead to the capability of bouncing the beam off the initial target and on to further targets. This acts as a force multiplier, allowing a smaller number of fighters to face down more numerous foes-exactly how Loyal Suns pilots like it."
  },
  "ion_cannon_50":{
    "name"          : "Ion cannon, 50 Coulomb",
    "tech"          : {"pirate": 2},
    "price"          : 1200,
    "space"          : -5,
    "weapon"      : {
      "mesh":  "plasma_cannon",
      "skin":  "ion",
      "sprite": "ion",
      "inaccuracy": 0.1,
      "period": 500,
      "velocity": 0.04,
      "proj": {
        "explosion": "ion_impact_small",
        "force": 0.01,
        "damage": 8,
        "shield_damage": 25,
        "max_age": 5000,
        "collider": {"notunnel": true},
        "ionize": 1,
        "disabler": true
      }
    },

    "desc"           : "Designed to disrupt a ship's critical systems, ion weapons are a favorite of discriminating pirates. A high risk/high reward play, an ion weapon won't take a foe out of the fight nearly as quickly as, say, hot plasma. It will, however, ionize the target ship, which will trash a ship's reactors, some engines and weapons, leaving them dead in the water-perfect prey" 
  },
  "ion_cannon_200":{
    "name"           : "Ion Cannon, 200 Coulomb",
    "tech"           : {"pirate": 2},
    "price"          : 4800,
    "space"          : -22,
    "weapon"         : {
      "mesh":  "plasma_cannon",
      "skin":  "ion",
      "sprite": "ion_large",
      "inaccuracy": 0.09,
      "period": 2000,
      "velocity":0.04,
      "proj": {
        "explosion": "ion_impact",
        "force": 10,
        "shield_damage": 75,
        "damage": 30,
        "max_age": 4000,
        "collider": {"notunnel": true},
        "ionize": 10,
        "disabler": true
      }
    },

    "desc"           : "A scaled-up ion cannon. Its operation is similar to a plasma cannon of similar description, but rather than superheating the plasma in the chamber, it's modified to ionize the plasmas much as possible. One of the challenges with this technology is ditching the extra electrons stripped from the plasma. They're ferociously attracted to the now ionized target, so they need to be carefully managed."
  },
  "mining_laser":{
    "name"           : "Mining Laser, 50gw",
    "tech"           : {"xic": 2},
    "price"          : 50000,
    "space"          : -6,
    "weapon"         : {
      "mesh":  "plasma_cannon",
      "period":0.001,
      "beam": {
        "graphics": {
          "type": "tube",
          "radius": 0.2,
          "color": [0.8, 1, 0.8],
          "emissive_color": [0.5, 1, 0.5]
        },
        "force": 10,
        "shield_damage":15,
        "damage":25,
        "length":15
      }
    },
    "desc"           : "Suitable for light mining duty, the mining laser is used to ablate, cut, and even vaporize asteroids into small enough chunks to scoop them up for sale. Be careful where you point it."
  },
  "heavy_mining_laser":{
    "name"           : "Mining Laser, 200gw",
    "tech"           : {"xic": 2},
    "price"          : 50000,
    "space"          : -20,
    "weapon"         : {
      "mesh":  "plasma_cannon",
      "inaccuracy": 0,
      "period":0.001,
      "beam": {
        "graphics": {
          "force": 20,
          "type": "tube",
          "radius": 0.3,
          "color": [0.8, 1, 0.8],
          "emissive_color": [0.5, 1, 0.5]
        },
        "length":30,
        "shield_damage":60,
        "damage":120,
        "length":25
      }
    },
    "desc"           : "A core component of the XIC drillship is its powerful mining laser. It can be tuned specifically to maximize energy delivery to the target asteroid. As always, exercise caution while mining operations are being conducted. Eye protection suggested."
  },
  "casuba_howitzer":{
    "name"           : "4m Casuba Howitzer",
    "space"          : -20,
    "desc"           : "Nuclear weapons, while very effective in terrestrial operations (as many planets scarred from the Empire's conquest will attest) without a medium to propagate their shock wave, and ever-present shields adept at dissipating their X-Ray emissions, they are a rare sight in space combat. The bright, shining exception is the Casuba Howitzer-it fires shaped detonators which focus the plasma into a devastating jet.",
    "price"          : 500,
    "exclass"        : "autocannon",
    "weapon"      : {
      "mesh":  "plasma_cannon",
      "period": 0.01,
      "inaccuracy":0,
      "period":1000,
      "ammo":"casuba_howitzer_ammo",
      "beam": {
        "force": 100,
        "shield_damage":1000,
        "damage":1000,
        "length":300,
        "graphics": {
          "type": "tube",
          "radius": 1,
          "color": [0.9, 0.9, 0],
          "emissive_color": [0.9, 0.9, 0]
        }
      }
    },
    "tech"           : {"league":3}
  },
  "casuba_howitzer_ammo":{
    "name"           : "Casuba Howitzer Charges",
    "space"          : -5,
    "desc"           : "Similar in design in function to the much feared atomic bomb, the perfectly machined shape (not dissimilar to the explosively formed penetrators used in autocannon ammo) absorbs the X Rays from the explosion to heat what becomes the plasma jet. One notable feature of these shaped charges is their price - because they use fissile material which has to be mined (it's rare) and dragged into orbit (it's heavy) and must be made with great skill and precision, it's the most expensive shot you can possibly take. Make it count.",
    "price"          : 10000,
    "require"        : "autocannon",
    "tech"           : {"league":3}
  },
  "fleetbreaker": {
    "name"           : "Fleetbreaker",
    "space"          : -30,
    "desc"           : "The scientists on Kalush have outdone themselves. Gravity, long their reviled foe, has become their greatest ally. Partially inspired by degenerate matter weapons employed by their Itaskan foes, and fueled by the ever-enigmatic entangled matter, they present: the fleet breaker, a weapon that can create a micro-scale black hole. If left to its own devices, it will decay into hawking radiation fairly quickly. If, however, it should have the opportunity to crush a target, it'll have that much more mass and stick around that much longer. Best used alone, directly in the middle of an enemy formation. But I'm sure you wouldn't have it any other way.",
    "price"          : 50000,
    "weapon"      : {
      "mesh":  "plasma_cannon",
      "sprite": "plasma",
      "inaccuracy": 0.09,
      "period": 500,
      "velocity": 0.04,
      "consume_fuel": 1,
      "proj": {
        "damage": 100,
        "shield_damage": 50,
        "max_age": 50000,
        "collider": {"radius": 1},
        "persist": true,
        "attract": 10,
        "damage_done_increases_lifetime": true
      }
    },
    "tech"           : {"loyal":3}
  },
  "applique_armor":{
    "name": "Applique Armor",
    "space": -5,
    "price": 1000,
    "max_hull": 100,
    "tech": {"generic": 1},
    "desc": "Survival in space depends on keeping space on the outside and air on the inside. Sure, everyone drills for hull breach - reach for masks and gloves, don helmets, communicate by radio and hand sign. But at the end of the day, the ship that keeps its atmosphere usually wins the fight. Sometimes that means welding on additional pieces of armor over weak spots, even if the design does not call for them."
  },
  "fighter_bay_expansion": {
    "name": "Fighter Bay Expansion",
    "space": -50,
    "price": 10000,
    "tech": {"generic": 2},
    "fighter_space": 10,
    "desc": "Maintaining an entire fleet of fighters is hard enough on the ground, and it only gets more difficult in the vaccum of space. The enclosed area in this upgrade can not only house several fighters, but also the tooling and other support required to keep them spaceworthy."
  },
  "fighter_bay": {
    "name": "Fighter Bay",
    "space": -35,
    "price": 30000,
    "tech": {"generic": 3},
    "fighter_space": 5,
    "fighter_launch_per_second": 1,
    "desc": "It's by no means a simple procedure, but with this upgrade a ship can be retrofitted to launch fighters even if your ship wasn't originally designed to carry them. You'll need to make room, of course, and your mess hall may not be equipped to deal with a ravenous space-jockey squadron, but many freigher captains are willing to make the trade for extra protection. Make sure you can also afford to purchase fighters-they're not included."
  },
  "cloak":{
    "name": "Stealth Tech",
    "tech": {"caudron": 3},
    "cloak": true,
    "desc": "Target acquisition relies on a few factors. Cameras using machine vision track a target in visual light, radar tracks a known target's position by bouncing radiation off of it, and IR scopes can see a target's drive signature against the cold of space. The feverish scientists on Nightside, however, have developed a treatment for a ship's hull that will eliminate almost all reflectivity, rendering the ship effectively invisible to both the naked eye and sensors. Sure, they might see you blocking the light of distant stars, but in the heat of battle, for all intents and purposes, you're invisible."
  }
}  

